[
    {
        "url": "https://www.linkedin.com/jobs/view/1st-shift-assistant-operator-%E2%80%93-pick-choose-your-shifts-at-myworkchoice-3854123144?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=XMEb4PlhETIa0mzJKULQIw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "1st Shift Assistant Operator – Pick & Choose Your Shifts",
            "company_name": "MyWorkChoice",
            "location": "Rome, GA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Join MyWorkChoice Where Work-Life Balance isn’t a BuzzwordAre you looking for a job but find it difficult to balance work shifts and your personal life? We have the job for you! As an Assistant Operator hired by MyWorkChoice, you'll get the best of both worlds: the opportunity to work at Mohawk while having control over your work schedule.What You’ll DoAt this Mohawk facility in Rome, GA, you will be a part of a team that meets the production needs by:Assisting operator with production tasksInspect products for quality controlOther duties as assigned by the team lead/supervisorWhat’s in it for You?$16/hr - Paid every FridayWork-life Balance – Choose your shift schedule in the MWC appFinancial Flexibility – Get your money faster before payday through EarnInCareer Advancement OpportunitiesWork Hours*Sunday – Saturday (Pick & Choose Different Shifts)6 AM – 12 PM (6 Hrs)12 PM – 6 PM (6 Hrs)6 AM – 6 PM (12 Hrs)TrainingSchedule your preferred training shift easily through the MyWorkChoice app:8 AM – 12 PM12 PM – 4 PMAvailable Tuesday – FridayLooking to balance a job and your personal life? Apply to be an Assistant Operator with MyWorkChoice today. You’ll get a reliable job and the MWC app makes it easy for you to pick up shifts 24/7.Questions? Give us a call at (866) 824-4898 from 8:00 am to 8:00 pm, Monday through Friday.Working at this Mohawk facility is conditional upon first-day drug screening and meeting background requirements."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854113341?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=xQSipO461tTIUvOUox0grQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Colorado Springs, CO",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRJcbtWX7zvQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854108853?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=puBjHYNN1uBbG4vrVQVCoA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Fort Wayne, IN",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRZwM5CF6W5N"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-at-navigate-new-horizons-3854110775?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=4GeylLHExO0FfwMNBtHweg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant",
            "company_name": "Navigate New Horizons",
            "location": "Dayton, OH",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Passion for travel draws many to this field, but for success as a Travel Scheduling Assistant, one must embrace not just the allure of travel but also the vast opportunities it offers in connecting histories, cultures, and cuisines. Thriving in this role demands a robust sales acumen, impeccable organizational prowess coupled with a keen eye for detail, adeptness in multitasking within a dynamic environment, proficiency in computer navigation and software applications, as well as effective written and verbal communication skills, all while maintaining a commitment to continuous learning.At our company, we seek individuals who resonate with our values and are eager to push their boundaries both personally and professionally, individuals who are driven by a passion for service and making a meaningful impact on others' lives.Here's an incredible business opportunity to curate dream vacations and craft cruise itineraries with the industry's leading names!Description:Arrange Cruise Travel for vacations, honeymoons, weddings, and more.Determine customer's needs and preferences, such as schedules, costs, and payment plans.Plan and arrange tour packages, excursions, and day trips.Book reservations for travel, hotel, flights, rental cars, special events, and honeymoons.Benefits:Full Training Provided.Flexible Work Hours - Part-Time or Full-Time.No Prior Experience Necessary.Travel Perks Available.Licensed & Bonded.Personalized Website Provided.Access to Daily Training Sessions.Certification Opportunities Offered.Remote Business Opportunity.Requirements:Must be 18+.Computer with good WiFi.Self-Motivated.Detail-Oriented.Customer Service Skills are a plus.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. This is a 1099 Business Opportunity. Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRPyWyeo79kn"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854112372?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=PpErciED3s%2Fh5kPaEDd3Og%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Tacoma, WA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRPQxB4cJH7W"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/front-counter-customer-service-rep-at-angelus-block-co-inc-3854120014?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=Ai3fJ41HvwDaHiWN9g3NhA%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Front Counter Customer Service Rep",
            "company_name": "Angelus Block Co., Inc.",
            "location": "Los Angeles, CA",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Job DescriptionInterested Candidates will need to complete an application onsite from Monday through Friday 07:00am to 05:00PM at the following address:11374 Tuxford StreetSun Valley, Ca 91352Angelus Block Company, Inc. is currently seeking to hire a Full-time Customer Service for ourSun Valley, Ca Plant. The Customer Service Representative will assist customers and process orders at inside sales counter and by phone.Description:Looking for an experienced Customer Service Representative in a fast paced environment demanding strong organizational, problem solving, and prioritization skills.Customer Service Representative will provide support to the organization by ensuring that an excellent standard of service and a high level of customer satisfaction is maintained.In addition, the Customer Service Representative will prepare customer service summary reports, and coordinate the handling of difficult and/or unusual situations.Full-time position, from Monday through Friday.Skills/Qualifications:Experience working with building materials is strongly preferred.Detail oriented, resourceful, and thorough in completing projects.Ability to multi-task effectively.Exceptional communication skills, proactive and friendly, conscientious and diligent, committed to contributing to operational goals in a positive, productive way.Proven success at improving customer service, workflow processes and production.Able to work under pressure/deadlines.Ability to communicate effectively in written and verbal forms (e-mail, in-person, telephone).Bilingual (English and Spanish) is preferred but not required.Other duties may be assigned.Experience and/or Education:High school diploma or general education degree (GED) and 4 years related experience and/or training or equivalent combination of education and experience.Possess basic to intermediate math skills.To perform this job successfully, an individual should have knowledge of Microsoft Windows Systems and Microsoft Office Applications.Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.Physical DemandsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit, stand; walk; use hands to finger, handle or feel; and reach with hands and arms. Lifting, pushing, pulling up to 25 lbs.Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.Angelus Block Company, Inc. offers a competitive salary.Angelus Block Company, Inc. is an Equal Opportunity Employer.Company DescriptionFounded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units.Founded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854110768?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=sGFK2NXo9fvR9Z0fKyhA0g%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "California, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity 1009 Commission Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, Australia, MexicoPowered by JazzHRWOh4KOwwjX"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854109807?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=MIuBzNmUc0jJtIKkZVfvNg%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Position: Home-Based Reservation Agent - Thriving Business Opportunity in the Travel IndustryAre you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryNote: This opportunity is available for candidates within the USA, Mexico and AustraliaPowered by JazzHRe8s4AC5jHQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-event-planner-entry-level-at-navigate-new-horizons-3854110777?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=fhA2NrmODQDcSrNNgJX%2BzA%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online- Event Planner/Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "This is a remote position. We are searching for highly self-motivated and entrepreneurial-minded people who will benefit from creating a flexible work schedule that has the potential to give the life-work balance youve always wanted. Workaround family commitments and have time for your passions. Live where you want and say goodbye to commuting.About Us:We work with Companies that require our services for planning, scheduling, organizing and coordinating company events, seminars, team building events or gatherings and other company related requirements. Full training and ongoing support are providedDuties and Responsibilities:The duties and responsibilities of an Event Planner require the ability to communicate well with customers and venues. Event planners must pay careful attention to detail using information from several sources to plan a successful event. Other Event Planner responsibilities include:Listening attentively to customer requests and keeping records of these requestsManaging and budgeting customer financesSelecting an appropriate venue suitable for the type of eventHaving good knowledge of geographic locations and their main attractionsOrganizing audiovisual equipment in advanceCoordinating hotels, transportation and foodAttending and monitoring activities to ensure client satisfactionReviewing bills and approving paymentsFollow a turn-key business model and strategy.Identify and develop niche target markets. You can book sports, concerts, car, air, hotels, all-inclusive resorts, cruises etc. or book any of these categories, you choose.Research, plan, and present a quote to clientsWork directly with suppliers such as Expedia, Golden Tickets, Norwegian Air, Hertz, etcOnce the itinerary for an Event is agreed on, collect credit card payments and send email confirmations Make changes if needed to book Events.Requirements:Professional phone and email communication.No experience necessary, we will train you.The ability to work independently with full support of a team and trainingNeed a laptop or smart phone and WI-FIRemote OpportunityMust be proficient in English, Bilingual a plusBenefits:Flexible SchedulePersonal WebsiteDaily Training AvailableRemote Opportunity Business OpportunityAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Bolivia, Chile, Colombia, Costa Rica, Ecuador, Panama, PeruThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business Opportunity This is NOT a job.Join our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRHq3UlalUoM"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854111595?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=tn%2BewA%2F1gIVEAPDGVD%2BUxg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Minnesota, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRvyygM3g5OP"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854109813?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=dOq3iDBJbsK5xG0m7D1wrA%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, AustraliaPowered by JazzHRYyEDI0QMC6"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/homemaker-at-pennybyrn-3854114966?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=ouYdn4ssJe7RGOHCC%2FSnIw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Homemaker",
            "company_name": "Pennybyrn",
            "location": "High Point, NC",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "Job DescriptionPennybyrn has an opportunity for a Homemaker to join our innovative, inclusive, and compassionate life-enriching community! For more than 70 years, Pennybyrn has been a leader in providing compassionate service and care to older adults. Our non-profit organization embraces a faith-based mission to \"Demonstrate God’s Love for the Lives we touch\", and we are committed to honoring our core values of:Faith in ActionSupport an empowered, compassionate communityNurture the human spirit and appreciate the individualAccountabilityExcellence in ServiceContinuous Education and GrowthResponsibilities of this position:We are hiring for Part Time & Full Time. Shifts available are part-time with hours ranging from 6:00 am - 2:00 pm, or 10:00 am - 6:00 pm, including weekends. The Homemaker performs the combined duties of dining services and housekeeping. As cook, the homemaker will prepare food for household meals and snacks that are healthy and appetizing and served in a timely manner, maintaining high quality standards and portion control using standardized recipes. The Homemaker assumes general responsibility for the kitchen in the absence of the Dietary Manager. Assists with serving resident meals, snacks and nourishment. Plans and facilitates activities for elders and the household that involve food preparation or other activities specific to the kitchen. Performs housekeeping duties to maintain cleanliness and neatness of resident bedrooms, living areas, restrooms and kitchen, including sweeping, mopping, dusting, etc.Why work with us?Pennybyrn is a resident-centered retirement community with a team-driven culture that is truly engaging and unique! Located in High Point, NC, our community consists of Independent Living, Assisted Living, Healthcare Households, Transitional Rehab, Memory Support, and coming soon, Adult Day Care. Candidates who enjoy working with older adults and strive to inspire extraordinary living in others will love becoming a part of our team!What sets us apart?We strive to create and maintain an outstanding work environment that includes a rich benefit package:PTO (Paid Time off) eligibility for all employeesExcellent low-cost and no-cost insuranceRetirement Plan (401k) with Employer MatchingAdvancement of earned daily wagesEmployee Assistance and Education opportunitiesNC Apprenticeship Nursing programFree Fitness Center and Wellness programsDelicious, high quality, freshly made meals in a variety of venuesDiscounted services for Barber/Beauty shop and Massage TherapyBeautiful, mature campus with walking trailsFaith-based and mission-driven since 1947, with a rich and vibrant Irish heritageA true, team spirit and belief in making a difference togetherEnthusiastic and sincere appreciation for every person every day!Company DescriptionPennybyrn is a unique community that offers innovative choices in senior living. In our seven decades of caring, we’ve earned a reputation for compassion, excellence, and quality that truly sets us apart.Non-Profit, Faith-Based Mission and ValuesYou’ll find a loving, warm, and respectful way of life that honors the dignity of each person in the Pennybyrn community. Dedication to these faith-based values translates to a high standard of service and care delivered with utmost compassion. Founded in 1947 by the Poor Servants of the Mother of God, a Catholic order, we continue to serve all faiths with love.Welcoming CommunityOur smaller population means those in our care receive personalized service and attention. Our inclusiveness means resident's voices are always heard. There's a natural camaraderie at Pennybyrn among staff and residents and who soon know each other well and feel as close as family.Natural Beauty and Relaxed EnvironmentThe beauty of our 71-acre community balances expert landscaping with stunning natural views. This peaceful setting helps relax, inspire, and lift the spirits.A Leader in Innovative Senior Living and Life-Enriching ServicesFrom delicious dining options and a wide array of fitness opportunities, to special speakers and clubs, Pennybyrn designs programs and activities with high resident involvement. Pennybyrn is the only community in North Carolina to implement a comprehensive and complete household care model for assisted living, memory care, skilled nursing, and transitional rehabilitation.Pennybyrn is a unique community that offers innovative choices in senior living. In our seven decades of caring, we’ve earned a reputation for compassion, excellence, and quality that truly sets us apart. Non-Profit, Faith-Based Mission and Values You’ll find a loving, warm, and respectful way of life that honors the dignity of each person in the Pennybyrn community. Dedication to these faith-based values translates to a high standard of service and care delivered with utmost compassion. Founded in 1947 by the Poor Servants of the Mother of God, a Catholic order, we continue to serve all faiths with love. Welcoming Community Our smaller population means those in our care receive personalized service and attention. Our inclusiveness means resident's voices are always heard. There's a natural camaraderie at Pennybyrn among staff and residents and who soon know each other well and feel as close as family. Natural Beauty and Relaxed Environment The beauty of our 71-acre community balances expert landscaping with stunning natural views. This peaceful setting helps relax, inspire, and lift the spirits. A Leader in Innovative Senior Living and Life-Enriching Services From delicious dining options and a wide array of fitness opportunities, to special speakers and clubs, Pennybyrn designs programs and activities with high resident involvement. Pennybyrn is the only community in North Carolina to implement a comprehensive and complete household care model for assisted living, memory care, skilled nursing, and transitional rehabilitation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854110764?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=fhnUsuii6H6pNSU1ZQoUOw%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Are you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryThis opportunity is available for candidates within the USA, Mexico and Australia and United KingdomPowered by JazzHRrQqNzTr0HK"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-administrator-at-discover-the-world-global-3854120203?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=hiPRN%2B6O%2Bvp%2BSdIcWMe4tw%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Administrator",
            "company_name": "Discover the World - Global",
            "location": "United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Global HR AdministratorWe are looking for a motivated and enthusiastic Global HR Administrator to join our team!Our people are our greatest asset, and you will lead by delivering a positive experience for our teams, offering friendly customer service along with a sense of urgency.You will serve as the main point of contact companywide, supporting both employees and department heads in HR related duties ranging from onboarding to answering enquiries such as payroll questions, benefits, employee records, and time tracking. You are skilled at handling employee information with the sensitivity and confidentiality it deserves.You will have experience in multi-country payrolls, with working experience in the USA and United Kingdom, being the most essential. You will work with our payroll vendors and help us streamline processes and improve our ability to centralize global payroll activities and reporting.Responsibilities:Participate and coordinate employee onboarding. You will ensure a smooth process of new hires from creating new employee records, explaining, and setting up employee benefits, reviewing company policies, and gathering payroll information such as withholding, and getting signatures on documents.Lead and coordinate collection of all employee documents and records across multiple countries. ensuring accurate employee records by recording hiring, transfers, terminations, change in job classifications, merit/bonus dates, and tracking time off such as vacations and sick time.Oversee and protect confidential information such as employee records, compensation, issues, and any sensitive information.Secure and review benefits annually such as healthcare and retirement/pension providersManage end-to-end payroll processes for multiple countries (starting with the USA & UK) including data collection, calculations, and disbursements, to ensure accurate and timely payments.Work closely with accounting teams to make sure payroll is accurately funded each month.Provide payroll and employee reports to leadership team.Collaborate with payroll service providers and vendors, ensuring service levels meet established standards. Manage relationships to optimize payroll processes and resolve any issues.Identify opportunities for streamlining payroll processes and payroll reports, and vendors.QualificationsExperience in handling employee onboarding, record keeping and benefit analysis.A minimum of 2 years of multi – country payroll experience. Experience with ADP and knowledge of ADP global payroll capabilities preferred.Ability to work independently and ensure all payrolls are done on time and accurately.Excellent people skills (written and verbal).Ability to balance multiple projects simultaneously, is flexible, enjoys collaborating with other teams and is deadline driven.Proficiency with data analysis, - Microsoft Excel & knowledge of Microsoft Office,Certifications in CPP or FPC payroll are a plus, but not required."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-hotel-reservationist-entry-level-at-navigate-new-horizons-3854112381?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=CCMpxqs%2FnD7xIhZOyfQJaA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online-Hotel Reservationist/Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Indianapolis, IN",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Do you possess an eye for detail and a drive for providing exceptional customer service? We're offering a lucrative business opportunity for individuals interested in leveraging the tools provided by our host agency to thrive in the travel industry. As a Hotel Reservationist, you'll focus on booking accommodations and managing room reservations for our clients, all within the framework of your own business.Responsibilities:Manage hotel reservations, handling inquiries, bookings, and confirming room availability.Interact with guests through various channels, assisting with inquiries, changes, and cancellations.Ensure a seamless check-in and check-out process, addressing special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as required.This remote position allows you to work from the comfort of your home or any location with internet access. With the flexibility to balance work and personal life, you can deliver exceptional event experiences for our clients while building your own business.Why Choose this Opportunity:Flexible Work Environment: Manage your work effectively from anywhere, adapting to your lifestyle. Business Ownership: Take control of your financial future within our framework, with opportunities for career advancement. High Commissions: Earn competitive travel commissions based on successful bookings. Comprehensive Training: Benefit from comprehensive training and ongoing development programs to ensure your success. Supportive Community: Join a dynamic community of like-minded individuals, receiving mentorship and guidance on your entrepreneurial journey.Qualifications:Excellent communication and interpersonal skills with a courteous demeanor.Strong organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and as part of a team.Thorough knowledge of travel destinations, attractions, and travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and helping others create memorable experiences.18+ years oldMust be proficient in English, Bilingual a plusBenefits:Remote position with a flexible work environment.Travel perks and discounts for personal and professional travel.Free training, FAM Trips, and ongoing support from a collaborative team.If you're ready to embark on an entrepreneurial journey in the exciting world of hospitality and travel, join our team today. This entry-level position serves as your gateway to making a positive impact on travelers' lives while fostering your professional growth. Start your entrepreneurial journey in the travel industry and explore the world, one exceptional experience at a time. Unlock your freedom and entrepreneurial potential by joining our team now. This is a 1099 Business OpportunityAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Bolivia, Chile, Colombia, Costa Rica, Ecuador, Panama, PeruPowered by JazzHR3iNUppz8q5"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/marketing-consultant-at-swell-partners-3854131156?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=zsBhrVSCiD%2FGlVofPQ5Fzg%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Marketing Consultant",
            "company_name": "Swell Partners",
            "location": "New York, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Contract",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Our client, a healthcare technology company, is looking to hire a Marketing Consultant, who will join the Strategic Client and Segment Growth Marketing team, concentrating on implementing engagement strategies to boost consumer adoption and generate revenue growth. This pivotal role requires strategic insight coupled with operational prowess, collaborating extensively with cross-functional teams and clients to bolster member engagement and deepen client relationships. The ideal candidate will possess a robust B2B2C marketing background, exemplary client management capabilities, and a fervent interest in advancing healthcare innovation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/entry-level-online-marketing-specialist-at-navigate-new-horizons-3854114280?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=OqN15pHMznFohDxhkgXuWQ%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Entry Level-Online Marketing Specialist",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Powered by JazzHR2TbFar2BOq"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/litigation-paralegal-insurance-defense-at-roberts-markel-weinberg-butler-hailey-pc-3854122137?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=Eah0sc%2B%2FeFgE7bglyoAY%2BQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Litigation Paralegal - Insurance Defense",
            "company_name": "Roberts Markel Weinberg Butler Hailey PC",
            "location": "Austin, TX",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionWe have a great opportunity for a Paralegal with 3-5 years of Insurance Defense Litigation experience in our Bee Cave location.Qualified candidates must have a minimum of three years of full time experience as a billable paralegal or legal assistant. Candidates must be self-motivated, committed to excellence in the workplace, and have excellent attention to detail. Candidates must also have demonstrated ability to prioritize and balance competing demands and meet deadlines in a fast-paced professional environment. Excellent writing skills are required, and candidates must be proficient in the use of PowerPoint, Word, Excel, and database applications. Trial experience is preferred.KNOWLEDGE, SKILLS, AND ABILITIES:Summarizing cases and preparing reports for attorneysConducting research, investigating facts and developing legal argumentsDrafting legal documents such as contracts, depositions and pleadingsPreparing and filing documents with courtsCalendaring/scheduling for multiple attorneysStrong ability to multi-task; high level of time-management skills.Attentive to details with good follow through and follow up, possess the ability to anticipate what needs to be done.Superior verbal and written communication skills; excellent proofreading skills.Ability to effectively interact and communicate with others, both externally and internally all organizational levels and locations.Strong knowledge of MS Office applications, including Word, Excel, PowerPoint, and Outlook. Ability to learn and effectively utilize various computer applications and other forms of technology.Ability to maintain a customer/client focus and build rapport with others inside and outside the firm.High level of professionalism; maintain confidential information.Proven ability to take initiative in order to meet client/customer needs.Work independently with minimal supervision.Ability to adapt to changing priorities and remain calm in high pressure situations.TRAINING AND EXPERIENCE:Minimum High School Diploma or equivalent.Bachelor’s Degree or Paralegal Certificate a plus.Proficiency with e-filing.A minimum of three years experience in a similar position.May be required to act as a Notary Public.Benefits:Some of our most popular additional benefits at our Firm include: flexible working environment, remote working, paid lunches, paid parking, and a wellness program which includes Corporate sponsored Lifetime Fitness memberships or gym reimbursements.Compensation is based on experience. Bonus eligible. Firm benefits include 401(k), medical, dental, vision, supplemental policies, long term care, identity theft and legal services, life insurance, and pet insurance. The firm offers parental leave.Roberts Markel Weinberg Butler Hailey PC is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.Company DescriptionRoberts Markel Weinberg Butler Hailey PC has provided the experience and service our clients require for their transactional and litigation needs for more than 40 plus years. Our practice areas include community associations, labor and employment for business owners and employers, professional liability, directors and officers litigation, fiduciary litigation, commercial litigation, elder law, appeals, construction law, corporate matters and real estate transactions.Roberts Markel Weinberg Butler Hailey PC has provided the experience and service our clients require for their transactional and litigation needs for more than 40 plus years. Our practice areas include community associations, labor and employment for business owners and employers, professional liability, directors and officers litigation, fiduciary litigation, commercial litigation, elder law, appeals, construction law, corporate matters and real estate transactions."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/medical-receptionist-at-medmasa-3854124834?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=TdwMEviJOAbwzZgVJBihGw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Medical Receptionist",
            "company_name": "MedMasa",
            "location": "Jacksonville, FL",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionMedical Receptionist/ Jacksonville, FL USAPay rate: 14/hrShitfs: 08:00 am to 05:00 pmJob DescriptionWe are seeking a highly motivated and organized individual to join our team as a receptionist. This is a crucial role in our organization, as you will be the first point of contact for visitors, phone calls, and emails. You will play a key role in creating a positive first impression and ensuring the smooth operation of our office.Responsibilities:Greet visitors warmly and professionally, ascertain their needs, and direct them to the appropriate person or department.Answer and screen phone calls politely and efficiently, transferring calls as necessary.Process incoming and outgoing mail and packages.Schedule appointments and meetings using a scheduling software.Maintain an organized and presentable reception area.Prepare documents and presentations as needed.Assist with administrative tasks such as data entry and filing.Order office supplies and equipment.Perform other duties as assigned.Qualifications:High school diploma or equivalent required.Minimum of 1 year of experience in a receptionist or administrative role preferred.Excellent communication, interpersonal, and organizational skills.Proficient in Microsoft Office Suite.Ability to multitask and prioritize effectively.Positive and professional demeanor.Detail-oriented and accurate.Ability to work independently and as part of a team."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-marketing-specialist-entry-level-at-navigate-new-horizons-3854112380?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=%2FaR3aMy%2BrqifxI28u1sRIg%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online Marketing Specialist -Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Language: Must have English proficiency, Proficiency in a second language is advantageous.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Available in USA, United Kingdom, Argentina, Australia, Mexico, Columbia, Costa Rica, Ecuador, Panama, PeruPowered by JazzHRhow2WhXsNk"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/chief-business-officer-at-the-crox-group-3854162687?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=i2%2Bd2gn9mFpPS7Jb4fVA2w%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Chief Business Officer",
            "company_name": "The Crox Group",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "Role: Chief Business Officer/ Chief Growth OfficerLocation: Green Bay, WI (Remote)Job Type: Full Time PositionJob SummaryReporting to the CEO, this position will partner with the executive team and business unit leaders, as well as interact with members of the Board, to develop and drive organic and acquisition growth strategies and initiatives within the corporation and its affiliated companies, resulting in the achievement of our profitable growth and client stability goals. This position will be based out of the Green Bay, Wisconsin location with professional flexibility.Primary ResponsibilitiesActively participate in strategic planning and forecasting process to align the organization’s business strategies and long-term initiatives with profitable growth and client stability goalsPartner with CEO and business unit leaders to determine effective sales organization design, engage in selection of new team members (market leaders, client leaders, business development leaders) and related third-party resources, and maintain dotted-line relationship with sales and marketing team members across all companiesChampion the development, implementation, and effective application of sales and marketing practices and standard work processes/tools across all companies (e.g., brand/marketing standards, sales/marketing planning, sales process, proposal standards, presentation standards)Research/identify new markets, services, and delivery method opportunities in coordination with business unitsIdentify/leverage cross-selling opportunities between business unitsSponsor training and development initiatives supporting the development of the sales organization, including sales process, client negotiations, project pricing, portfolio management, and risk managementIn support of business unit client relationship activities, effectively engage with key clients, to include reviews of proposals and presentations, attending selected conferences, and participating in client partnership meetingsTravel to client sites and/or other local offices as neededAct as a role model to fellow members by demonstrating behaviours consistent with our brandRequired QualificationsBachelor’s degree in business, engineering, or related technical field15+ years of experience driving strategic growth in P&L leadership capacity for a mid-sized or larger company or significant business unit, including leadership of high-growth sales teams/functions.Preferred QualificationsEngineering degree and/or professional engineering license.Master of Business Administration.Knowledge of the markets in which company does business.Previous responsibility for marketing functions.Experience in a professional services/consulting environment.Mergers & Acquisitions (M&A) experience."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/entry-level-hotel-reservationist-virtual-at-navigate-new-horizons-3854115213?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=NTm4VTAZ3LJQ7YmMtf%2FfFw%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Entry Level-Hotel Reservationist/Virtual",
            "company_name": "Navigate New Horizons",
            "location": "New York, NY",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "We are actively searching for an individual with meticulous attention to detail and a customer-centric mindset to join our team as a Remote Hotel Reservationist. If you possess outstanding communication skills, radiate warmth, and harbor a genuine passion for hospitality, we extend a warm invitation for you to become part of our team today! Comprehensive training will be provided.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests through phone, email, and in-person, addressing reservation inquiries, changes, and cancellations.Assist guests during check-in and check-out, ensuring a seamless process and attending to special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as necessary.This remote position offers the flexibility to work from the comfort of your home or any location with an internet connection. We value the importance of work-life balance, enabling you to manage your workload in alignment with your lifestyle.As a Remote Hotel Reservationist, you have the opportunity to take control of your financial future. This isn't just a job; it's a chance to establish your own business within our framework. Determine your income potential, and we'll provide the support and resources to help you succeed, transforming your passion into a flourishing career.Benefits:Remote position with a flexible work environment.Competitive salary.Travel perks and discounts for personal and professional travel.Free training.Familiarization (FAM) Trips.Supportive team.Qualifications:Excellent communication and interpersonal skills with a courteous and welcoming demeanor.Organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and collaboratively as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.Must be 18 years or older.Must speak/read English fluently/bilingual a plus!!Available in USA, MEXICO, Costa Rica, Columbia, Argentina, Ecuador, Peru, PanamaUnited Kingdom, AustraliaThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHR0ZbQ4FrLUd"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/buyer-women-s-west-coast-at-brunello-cucinelli-3854175748?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=j201IR6JRTZJ%2FRq8AXxjlg%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Buyer, Women's - West Coast",
            "company_name": "Brunello Cucinelli",
            "location": "Los Angeles Metropolitan Area",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 36,
            "about": "About us:\"Those who work with us take part in the company’s life. Everybody knows that their work is an indispensable contribution to our shared growth \"– Brunello CucinelliBrunello Cucinelli, founded in 1978 by the eponymous designer and entrepreneur, is an Italian house operating in the absolute luxury sector, specializing in cashmere and the international informal luxury ready-to-wear sector. As a perfect blend of industry and craftsmanship, our products are designed to stand the test of time. The whole world is fascinated by the products of our country, by the careful selection of raw materials, and the search for the highest quality and creativity in every step of the production chain.Today, the Brunello Cucinelli company finds its true meaning and aesthetic pursuit in manual skills, craftsmanship and the exclusivity of its collections. They are the truest expression of humanity and of creativity and, as such, are fundamental to us.Who you are:The Women's Buyer is a key component in the success of our stores. As a member of the Buying team, the Buyer is responsible for ensuring success in all assigned categories of business for the West Coast doors. The ideal candidate possesses strong analytical skills, can creatively problem solve, and thrives in an entrepreneurial environment.What You’ll Do:Work with Buyer to understand departmental strategies and key goals for the seasonParticipate in seasonal assortment planning for stores, building strong relationships with retail store managers and cross-functional partners to discover missed opportunitiesBuilds and updates seasonal assortment sheets, line plans, and item SKU listsPrepare and maintain reporting and analysis such as best sellers, opportunities, and market reporting by style, category, doorAssist in order management and continued ownership of order files to ensure accurate rollout to all doorsManage all special-order requests relative to monobrand businessAssists with product transfersCompletes reports and recaps and communicates trends and financial metrics to key stakeholders including management, planning team, and international partnersAnticipates inventory opportunities, communicates recommendations, and takes corrective action with the guidance of buyer to solve problems and correct deficienciesCreates materials for store product knowledge seminars and participates in local clinics and eventsAdditional duties as assignedQualifications:Bachelor’s degree in fashion merchandising preferred3-5 years experience in a related role, preferably with a luxury brandProficient use of Microsoft Office products including Word, Excel and OutlookStrong retail math, analysis & financial planning skillsStrong sense of urgency and ability to problem-solveSets high standards for self; discusses goals with Buyer and achieves goalsConsistent demonstration of professionalism, sound judgment, and integrityMotivated and able to work well independently, as well as an effective member of a teamAbility to multi-task and provide timely follow-upEEOCBrunello Cucinelli is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status, or any other characteristic protected by law."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/hotel-reservationist-virtual-at-navigate-new-horizons-3854108871?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=OlMYsrVMcojcBzTjJ%2B3%2B2g%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Hotel Reservationist-Virtual",
            "company_name": "Navigate New Horizons",
            "location": "Jacksonville, FL",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Are you a detail-oriented individual with a passion for delivering exceptional customer service? We're currently looking for a Hotel Reservationist to join our team, focusing on booking accommodations and managing room reservations for our clients. If you possess excellent communication skills, a warm demeanor, and a love for hospitality, we invite you to apply.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests via phone, email, and in-person, assisting with reservation inquiries, changes, and cancellations.Ensure a smooth check-in and check-out process, addressing special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as needed.This remote position provides the flexibility to work from home or any location with an internet connection. Balancing work and personal life is achievable, allowing you to deliver exceptional event experiences for our clients.Why Choose this Opportunity:Flexible Work Environment: Work from the comfort of your home or anywhere with an internet connection, managing your work effectively to suit your lifestyle.Business Ownership: Take control of your financial future within our framework, building your own business and enjoying career advancement opportunities.High Commissions: Earn one of the highest travel commissions in the industry based on your successful bookings.Comprehensive Training: We're committed to your success, offering comprehensive training and ongoing development programs.Supportive Community: Join a dynamic and supportive community of individuals passionate about creating outstanding events. Receive mentorship and guidance on your unique business journey.Qualifications:Good communication and interpersonal skills with a courteous demeanor.Strong organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.18+ years old and a US resident.Benefits:Remote position with a flexible work environment.Travel perks and discounts for personal and professional travel.Free training, FAM Trips, and ongoing support from a collaborative team.If you're ready to be part of a dynamic team, shape your career in the exciting world of hospitality and travel.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRN8x6c3bRcr"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/hotel-reservationist-virtual-at-navigate-new-horizons-3854114257?refId=dK61jL8I5q9y%2BRpXq3vvbA%3D%3D&trackingId=Bp3PV0FSt8Gz9I4UUWfc7g%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Hotel Reservationist-Virtual",
            "company_name": "Navigate New Horizons",
            "location": "Florida, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Are you a detail-oriented individual with a passion for delivering exceptional customer service? We're currently looking for a Hotel Reservationist to join our team, focusing on booking accommodations and managing room reservations for our clients. If you possess excellent communication skills, a warm demeanor, and a love for hospitality, we invite you to apply.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests via phone, email, and in-person, assisting with reservation inquiries, changes, and cancellations.Ensure a smooth check-in and check-out process, addressing special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as needed.This remote position provides the flexibility to work from home or any location with an internet connection. Balancing work and personal life is achievable, allowing you to deliver exceptional event experiences for our clients.Why Choose this Opportunity:Flexible Work Environment: Work from the comfort of your home or anywhere with an internet connection, managing your work effectively to suit your lifestyle.Business Ownership: Take control of your financial future within our framework, building your own business and enjoying career advancement opportunities.High Commissions: Earn one of the highest travel commissions in the industry based on your successful bookings.Comprehensive Training: We're committed to your success, offering comprehensive training and ongoing development programs.Supportive Community: Join a dynamic and supportive community of individuals passionate about creating outstanding events. Receive mentorship and guidance on your unique business journey.Qualifications:Good communication and interpersonal skills with a courteous demeanor.Strong organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.18+ years old and a US resident.Benefits:Remote position with a flexible work environment.Travel perks and discounts for personal and professional travel.Free training, FAM Trips, and ongoing support from a collaborative team.If you're ready to be part of a dynamic team, shape your career in the exciting world of hospitality and travel.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRzOjjJRKSTF"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854113341?position=1&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=T7lBd6grjwSOPN1Cje36Yg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Colorado Springs, CO",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRJcbtWX7zvQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854110764?position=2&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=N1Sx1OWgny4wk5OiWIxSBQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Are you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryThis opportunity is available for candidates within the USA, Mexico and Australia and United KingdomPowered by JazzHRrQqNzTr0HK"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854110768?position=3&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=krPZiCS45KY9OvIE3AE88g%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "California, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity 1009 Commission Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, Australia, MexicoPowered by JazzHRWOh4KOwwjX"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854109807?position=4&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=IaXQMZs6fxvtPy7YZEVeMQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Position: Home-Based Reservation Agent - Thriving Business Opportunity in the Travel IndustryAre you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryNote: This opportunity is available for candidates within the USA, Mexico and AustraliaPowered by JazzHRe8s4AC5jHQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854111595?position=5&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=xskgRojat%2Fs7Bd%2By7kPrnQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Minnesota, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRvyygM3g5OP"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-event-planner-entry-level-at-navigate-new-horizons-3854110777?position=6&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=08uRGg%2FjLYpijlLuPO5LyQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online- Event Planner/Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "This is a remote position. We are searching for highly self-motivated and entrepreneurial-minded people who will benefit from creating a flexible work schedule that has the potential to give the life-work balance youve always wanted. Workaround family commitments and have time for your passions. Live where you want and say goodbye to commuting.About Us:We work with Companies that require our services for planning, scheduling, organizing and coordinating company events, seminars, team building events or gatherings and other company related requirements. Full training and ongoing support are providedDuties and Responsibilities:The duties and responsibilities of an Event Planner require the ability to communicate well with customers and venues. Event planners must pay careful attention to detail using information from several sources to plan a successful event. Other Event Planner responsibilities include:Listening attentively to customer requests and keeping records of these requestsManaging and budgeting customer financesSelecting an appropriate venue suitable for the type of eventHaving good knowledge of geographic locations and their main attractionsOrganizing audiovisual equipment in advanceCoordinating hotels, transportation and foodAttending and monitoring activities to ensure client satisfactionReviewing bills and approving paymentsFollow a turn-key business model and strategy.Identify and develop niche target markets. You can book sports, concerts, car, air, hotels, all-inclusive resorts, cruises etc. or book any of these categories, you choose.Research, plan, and present a quote to clientsWork directly with suppliers such as Expedia, Golden Tickets, Norwegian Air, Hertz, etcOnce the itinerary for an Event is agreed on, collect credit card payments and send email confirmations Make changes if needed to book Events.Requirements:Professional phone and email communication.No experience necessary, we will train you.The ability to work independently with full support of a team and trainingNeed a laptop or smart phone and WI-FIRemote OpportunityMust be proficient in English, Bilingual a plusBenefits:Flexible SchedulePersonal WebsiteDaily Training AvailableRemote Opportunity Business OpportunityAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Bolivia, Chile, Colombia, Costa Rica, Ecuador, Panama, PeruThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business Opportunity This is NOT a job.Join our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRHq3UlalUoM"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854109813?position=7&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=546NYNSgOb0gTsXMkSeuQg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, AustraliaPowered by JazzHRYyEDI0QMC6"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-at-navigate-new-horizons-3854110775?position=8&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=nQnjBDY9oGAp8DOrCQdK9w%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant",
            "company_name": "Navigate New Horizons",
            "location": "Dayton, OH",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Passion for travel draws many to this field, but for success as a Travel Scheduling Assistant, one must embrace not just the allure of travel but also the vast opportunities it offers in connecting histories, cultures, and cuisines. Thriving in this role demands a robust sales acumen, impeccable organizational prowess coupled with a keen eye for detail, adeptness in multitasking within a dynamic environment, proficiency in computer navigation and software applications, as well as effective written and verbal communication skills, all while maintaining a commitment to continuous learning.At our company, we seek individuals who resonate with our values and are eager to push their boundaries both personally and professionally, individuals who are driven by a passion for service and making a meaningful impact on others' lives.Here's an incredible business opportunity to curate dream vacations and craft cruise itineraries with the industry's leading names!Description:Arrange Cruise Travel for vacations, honeymoons, weddings, and more.Determine customer's needs and preferences, such as schedules, costs, and payment plans.Plan and arrange tour packages, excursions, and day trips.Book reservations for travel, hotel, flights, rental cars, special events, and honeymoons.Benefits:Full Training Provided.Flexible Work Hours - Part-Time or Full-Time.No Prior Experience Necessary.Travel Perks Available.Licensed & Bonded.Personalized Website Provided.Access to Daily Training Sessions.Certification Opportunities Offered.Remote Business Opportunity.Requirements:Must be 18+.Computer with good WiFi.Self-Motivated.Detail-Oriented.Customer Service Skills are a plus.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. This is a 1099 Business Opportunity. Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRPyWyeo79kn"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-administrator-at-discover-the-world-global-3854120203?position=9&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=jo7J4TzaDlRU%2Fmna5IRzww%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Administrator",
            "company_name": "Discover the World - Global",
            "location": "United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Global HR AdministratorWe are looking for a motivated and enthusiastic Global HR Administrator to join our team!Our people are our greatest asset, and you will lead by delivering a positive experience for our teams, offering friendly customer service along with a sense of urgency.You will serve as the main point of contact companywide, supporting both employees and department heads in HR related duties ranging from onboarding to answering enquiries such as payroll questions, benefits, employee records, and time tracking. You are skilled at handling employee information with the sensitivity and confidentiality it deserves.You will have experience in multi-country payrolls, with working experience in the USA and United Kingdom, being the most essential. You will work with our payroll vendors and help us streamline processes and improve our ability to centralize global payroll activities and reporting.Responsibilities:Participate and coordinate employee onboarding. You will ensure a smooth process of new hires from creating new employee records, explaining, and setting up employee benefits, reviewing company policies, and gathering payroll information such as withholding, and getting signatures on documents.Lead and coordinate collection of all employee documents and records across multiple countries. ensuring accurate employee records by recording hiring, transfers, terminations, change in job classifications, merit/bonus dates, and tracking time off such as vacations and sick time.Oversee and protect confidential information such as employee records, compensation, issues, and any sensitive information.Secure and review benefits annually such as healthcare and retirement/pension providersManage end-to-end payroll processes for multiple countries (starting with the USA & UK) including data collection, calculations, and disbursements, to ensure accurate and timely payments.Work closely with accounting teams to make sure payroll is accurately funded each month.Provide payroll and employee reports to leadership team.Collaborate with payroll service providers and vendors, ensuring service levels meet established standards. Manage relationships to optimize payroll processes and resolve any issues.Identify opportunities for streamlining payroll processes and payroll reports, and vendors.QualificationsExperience in handling employee onboarding, record keeping and benefit analysis.A minimum of 2 years of multi – country payroll experience. Experience with ADP and knowledge of ADP global payroll capabilities preferred.Ability to work independently and ensure all payrolls are done on time and accurately.Excellent people skills (written and verbal).Ability to balance multiple projects simultaneously, is flexible, enjoys collaborating with other teams and is deadline driven.Proficiency with data analysis, - Microsoft Excel & knowledge of Microsoft Office,Certifications in CPP or FPC payroll are a plus, but not required."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/marketing-consultant-at-swell-partners-3854131156?position=10&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=NzQZTKHHbVre5LfNxKibGw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Marketing Consultant",
            "company_name": "Swell Partners",
            "location": "New York, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Contract",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Our client, a healthcare technology company, is looking to hire a Marketing Consultant, who will join the Strategic Client and Segment Growth Marketing team, concentrating on implementing engagement strategies to boost consumer adoption and generate revenue growth. This pivotal role requires strategic insight coupled with operational prowess, collaborating extensively with cross-functional teams and clients to bolster member engagement and deepen client relationships. The ideal candidate will possess a robust B2B2C marketing background, exemplary client management capabilities, and a fervent interest in advancing healthcare innovation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854112372?position=11&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=QV0ckJRChZUaQzsJFPqSig%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Tacoma, WA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRPQxB4cJH7W"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-hotel-reservationist-entry-level-at-navigate-new-horizons-3854114255?position=12&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=2QXJ%2Fs%2FKqAmAiwwMtwhJ%2FQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Hotel Reservationist-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Florida, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "We are currently seeking an individual with a sharp attention to detail and a customer-focused mindset to join our team as a Hotel Reservationist. If you have outstanding communication skills, radiate warmth, and harbor a genuine love for hospitality, we invite you to become a part of our team today!Responsibilities:Handle hotel reservations, addressing inquiries, processing bookings, and verifying room availability.Engage with guests through phone, email, and in-person interactions, handling reservation inquiries, modifications, and cancellations.Assist guests during check-in and check-out, ensuring a smooth process and addressing any special requests or concerns.Collect payment details, process reservations, and issue invoices or receipts when necessary.This remote role offers you the flexibility to work from your home or any location with internet access.We understand the importance of work-life balance, empowering you to manage your workload in a manner that suits your lifestyle.As a Hotel Reservationist, you have the chance to take control of your financial future. This isn't simply a job; it's an opportunity to establish your own business within our framework. You can determine your earning potential, and we'll provide the guidance and resources to assist you in succeeding, transforming your passion into a thriving career.Benefits:Remote role with flexible work arrangements.Travel perks and discounts for personal and professional use.Complimentary training.Familiarization (FAM) Trips.Supportive team environment.Qualifications:Excellent communication skills and a friendly, courteous demeanor.Strong organizational skills and ability to multitask effectively.Attention to detail and commitment to accuracy.Capable of working independently and collaboratively within a team.Thorough knowledge of travel destinations, attractions, and various travel products and services.Outstanding customer service and problem-solving capabilities.Passionate about travel and dedicated to helping others create unforgettable experiences.Must be at least 18 years old.This entry-level opportunity serves as your introduction to the dynamic realm of the travel industry. Taking this initial step enables you to positively impact the lives of travelers while nurturing your professional development. Explore the world, one extraordinary experience at a time – start your entrepreneurial journey today. 1099 Business Opportunity.Join our team now to unlock your freedom and embark on your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRtWZwcAEAVx"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/chief-business-officer-at-the-crox-group-3854162687?position=13&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=qh3Eht4a1L0GpiHieo91xg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Chief Business Officer",
            "company_name": "The Crox Group",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "Role: Chief Business Officer/ Chief Growth OfficerLocation: Green Bay, WI (Remote)Job Type: Full Time PositionJob SummaryReporting to the CEO, this position will partner with the executive team and business unit leaders, as well as interact with members of the Board, to develop and drive organic and acquisition growth strategies and initiatives within the corporation and its affiliated companies, resulting in the achievement of our profitable growth and client stability goals. This position will be based out of the Green Bay, Wisconsin location with professional flexibility.Primary ResponsibilitiesActively participate in strategic planning and forecasting process to align the organization’s business strategies and long-term initiatives with profitable growth and client stability goalsPartner with CEO and business unit leaders to determine effective sales organization design, engage in selection of new team members (market leaders, client leaders, business development leaders) and related third-party resources, and maintain dotted-line relationship with sales and marketing team members across all companiesChampion the development, implementation, and effective application of sales and marketing practices and standard work processes/tools across all companies (e.g., brand/marketing standards, sales/marketing planning, sales process, proposal standards, presentation standards)Research/identify new markets, services, and delivery method opportunities in coordination with business unitsIdentify/leverage cross-selling opportunities between business unitsSponsor training and development initiatives supporting the development of the sales organization, including sales process, client negotiations, project pricing, portfolio management, and risk managementIn support of business unit client relationship activities, effectively engage with key clients, to include reviews of proposals and presentations, attending selected conferences, and participating in client partnership meetingsTravel to client sites and/or other local offices as neededAct as a role model to fellow members by demonstrating behaviours consistent with our brandRequired QualificationsBachelor’s degree in business, engineering, or related technical field15+ years of experience driving strategic growth in P&L leadership capacity for a mid-sized or larger company or significant business unit, including leadership of high-growth sales teams/functions.Preferred QualificationsEngineering degree and/or professional engineering license.Master of Business Administration.Knowledge of the markets in which company does business.Previous responsibility for marketing functions.Experience in a professional services/consulting environment.Mergers & Acquisitions (M&A) experience."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/junior-frontend-engineer-javascript-html-css-at-team-remotely-inc-3854140927?position=14&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=URJCBL3VFM4s9L0VJCFpdw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Junior Frontend Engineer (JavaScript/HTML/CSS)",
            "company_name": "Team Remotely Inc",
            "location": "Charlotte, NC",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 12,
            "about": "This is a remote position.Junior Frontend Engineer (JavaScript/HTML/CSS)(1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.Hiring Type:Full-TimeBase Salary:$62K-$72K Per Annum.ResponsibilitiesAutonomy of project implementationEfficient in coding reviewReporting directly to ownersAgile work-flowBuilding customer-facing applicationsMeta-development opportunitiesThe Successful ApplicantFront-end web experience coding in JavaScript/HTML/CSS.Willing to mentor junior talent.Eager to move into a lead role with rapid expected company growth.Comfortable working in a remote role.A dependable individual who can take initiative on cleaning up and expanding projects.Benefits:Competitive salary and benefits package.Remote work flexibility! Enjoy the freedom and convenience of working from anywhere with a stable internet connection.Opportunity to work on challenging and impactful projects that drive business results.Collaborative and supportive work environment.Continuous learning and development opportunities."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-marketing-specialist-entry-level-at-navigate-new-horizons-3854112380?position=15&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=reyY746ytmrEXMzqrOiI%2FQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online Marketing Specialist -Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Language: Must have English proficiency, Proficiency in a second language is advantageous.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Available in USA, United Kingdom, Argentina, Australia, Mexico, Columbia, Costa Rica, Ecuador, Panama, PeruPowered by JazzHRhow2WhXsNk"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/buyer-women-s-west-coast-at-brunello-cucinelli-3854175748?position=16&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=%2FltVyxOueiWxFtfP7Ri7Ew%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Buyer, Women's - West Coast",
            "company_name": "Brunello Cucinelli",
            "location": "Los Angeles Metropolitan Area",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 36,
            "about": "About us:\"Those who work with us take part in the company’s life. Everybody knows that their work is an indispensable contribution to our shared growth \"– Brunello CucinelliBrunello Cucinelli, founded in 1978 by the eponymous designer and entrepreneur, is an Italian house operating in the absolute luxury sector, specializing in cashmere and the international informal luxury ready-to-wear sector. As a perfect blend of industry and craftsmanship, our products are designed to stand the test of time. The whole world is fascinated by the products of our country, by the careful selection of raw materials, and the search for the highest quality and creativity in every step of the production chain.Today, the Brunello Cucinelli company finds its true meaning and aesthetic pursuit in manual skills, craftsmanship and the exclusivity of its collections. They are the truest expression of humanity and of creativity and, as such, are fundamental to us.Who you are:The Women's Buyer is a key component in the success of our stores. As a member of the Buying team, the Buyer is responsible for ensuring success in all assigned categories of business for the West Coast doors. The ideal candidate possesses strong analytical skills, can creatively problem solve, and thrives in an entrepreneurial environment.What You’ll Do:Work with Buyer to understand departmental strategies and key goals for the seasonParticipate in seasonal assortment planning for stores, building strong relationships with retail store managers and cross-functional partners to discover missed opportunitiesBuilds and updates seasonal assortment sheets, line plans, and item SKU listsPrepare and maintain reporting and analysis such as best sellers, opportunities, and market reporting by style, category, doorAssist in order management and continued ownership of order files to ensure accurate rollout to all doorsManage all special-order requests relative to monobrand businessAssists with product transfersCompletes reports and recaps and communicates trends and financial metrics to key stakeholders including management, planning team, and international partnersAnticipates inventory opportunities, communicates recommendations, and takes corrective action with the guidance of buyer to solve problems and correct deficienciesCreates materials for store product knowledge seminars and participates in local clinics and eventsAdditional duties as assignedQualifications:Bachelor’s degree in fashion merchandising preferred3-5 years experience in a related role, preferably with a luxury brandProficient use of Microsoft Office products including Word, Excel and OutlookStrong retail math, analysis & financial planning skillsStrong sense of urgency and ability to problem-solveSets high standards for self; discusses goals with Buyer and achieves goalsConsistent demonstration of professionalism, sound judgment, and integrityMotivated and able to work well independently, as well as an effective member of a teamAbility to multi-task and provide timely follow-upEEOCBrunello Cucinelli is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status, or any other characteristic protected by law."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/custom-travel-planning-assistants-virtual-at-navigate-new-horizons-3854111598?position=17&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=2lkYhcUFT%2BckDObHFIt84w%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Custom Travel Planning Assistants-Virtual",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We're seeking eloquent and engaging individuals to join our remote team. Our company's mission is to design unforgettable vacation packages that leave lasting impressions.As a valued team member, you'll demonstrate superb communication skills via phone, social media, and email to connect with and support clients in their vacation planning. This role not only offers personal growth potential but also the chance for financial independence and entrepreneurship. Collaborating closely with top-tier suppliers for cruises, resort stays, and events, you'll be part of a vibrant and supportive community.Responsibilities:Acquire supplier certifications to stay updated on industry developments.Work remotely, providing flexibility to manage your work-life balance effectively while delivering exceptional event experiences for clients.Enjoy the freedom to work from home or anywhere with internet access, recognizing life's unpredictable nature.Take charge of your financial future by establishing your own business within our framework.Determine your income potential with our support, turning your passion into a thriving career.Earn one of the industry's highest travel commissions based on successful bookings.Benefit from comprehensive training and ongoing development programs, equipping you with the skills to thrive in your role and beyond.Be part of a supportive community, collaborating with like-minded individuals passionate about the travel industry. Gain valuable experience by working on diverse projects, from corporate conferences to weddings and social gatherings.Utilize social media to maintain and market to your client base.Qualifications:Demonstrate knowledge and expertise in popular vacation destinations worldwide.Provide outstanding customer service with meticulous attention to detail.Utilize time management skills to research, plan, and book vacation packages for clients.Multi-task effectively while ensuring client satisfaction.Must be able to read /write English fluently. Bilingual a plusBenefits:Remote positionFlexible remote work environment.Competitive commissionTravel perks Discounts on personal and professional travel.Free training FAM TripsSupportive teamAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Columbia, Costa Rica, Ecuador, Panama, PeruIf you're seeking more than just a job and envision building your own business within our organization, join us on this thrilling journey. We offer mentorship and guidance to help you succeed and create outstanding events for our clients. This is a 1099 Business OpportunityPowered by JazzHRJ5ggShII6y"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/entry-level-online-marketing-specialist-at-navigate-new-horizons-3854114280?position=18&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=oaeEnYDpMJBO1Bl0hq8USQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Entry Level-Online Marketing Specialist",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Powered by JazzHR2TbFar2BOq"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/hotel-reservationist-remote-at-navigate-new-horizons-3854111658?position=19&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=qxhLwpHHaeXSxNITq2VtxQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Hotel Reservationist-Remote",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We are actively searching for an individual with meticulous attention to detail and a customer-centric mindset to join our team as a Remote Hotel Reservationist. If you possess outstanding communication skills, radiate warmth, and harbor a genuine passion for hospitality, we extend a warm invitation for you to become part of our team today! Comprehensive training will be provided.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests through phone, email, and in-person, addressing reservation inquiries, changes, and cancellations.Assist guests during check-in and check-out, ensuring a seamless process and attending to special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as necessary.This remote position offers the flexibility to work from the comfort of your home or any location with an internet connection. We value the importance of work-life balance, enabling you to manage your workload in alignment with your lifestyle.As a Remote Hotel Reservationist, you have the opportunity to take control of your financial future. This isn't just a job; it's a chance to establish your own business within our framework. Determine your income potential, and we'll provide the support and resources to help you succeed, transforming your passion into a flourishing career.Benefits:Remote position with a flexible work environment.Competitive salary.Travel perks and discounts for personal and professional travel.Free training.Familiarization (FAM) Trips.Supportive team.Qualifications:Excellent communication and interpersonal skills with a courteous and welcoming demeanor.Organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and collaboratively as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.Must be 18 years or older.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRt6RtAN6DDc"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-generalist-at-life-s-abundance-inc-3854148722?position=20&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=Cm0pW%2BhUZMPgH8ItlUEv3A%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Generalist",
            "company_name": "Life's Abundance, Inc",
            "location": "Jupiter, FL",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Join our Team of Employee Owners as a People and Culture Generalist!:Life’s Abundance is an employee-owned company, with a purpose of empowering people and pets to live healthier, happier lives. Since 1998, we've put our hearts into creating a positive impact on our team, our customers, our vendors, and the world community; with our employee owners being at the heart of everything we do. Our culture is vibrant, filled with energy, support, and a commitment to continuous improvement.As we continue to grow, it’s crucial that our culture does too. That’s why we need you! We're searching for a dynamic HR Generalist to play a key role within our People & Culture Department.If you believe that employees are a company’s most valuable asset and great workforce culture doesn’t happen without intention, keep reading. Critical component of the role is active and open collaboration with many departments, including the VP of Operations and the CEO.If you're passionate about making a meaningful difference and excited to work for a company where every employee has a stake in the success, we'd love to meet you!Responsibilities include:Partnering with the Executive team on decision-making concerning issues related to people and culture.Learning, understanding, and following the company’s methodology for hiring, onboarding, and offboarding employees.General HR responsibilities including benefits, investigations, time clock management, etc.Organizing and promoting our team-building activities across multiple locationsUnderstanding Life's Abundance culture and focusing on growing and improving it.Evolving and improving the People and Culture Department’s impact.Understanding and promoting employee ownership. Helping our employees understand and celebrate the benefits of working for a 100% employee-owned company (ESOP). Fostering an ownership mentality among our employee-owners.Improving employee training.Improving communication with employees about opportunities to advance their career within Life’s Abundance.Learner’s mindset with an interest in growing your knowledge in various HR facetsManaging the relationship between the company and our PEO ProviderWillingness and ability to travel domestically for professional development and team building.Life’s Abundance provides an ever-evolving opportunity for employee growth, and job responsibilities may be modified over time.What will make you a great fit:We are a technology-forward company, and being comfortable with cutting-edge technology, including AI, is a must.Strong people skills (naturally!)Active Listening - prioritizing understanding; responding with empathy and clarity.Strong verbal and written communication skills - ability to concisely and effectively communicate your thoughts and ideas to the team.Availability to work full-time, Monday through Friday.Experience with Kronos or similar TMSBachelor’s degree in HR, or a combination of experience and relevant certifications (SHRM CP/SCP, PHR)Previous supervisory experience is a plus but not required.An Abundance of Benefits:Paid Volunteer Time OffPaid Personal Time Off- because life happens, partial PTO is advanced on day 1.Medical insurance for the employee plus family that includes dental and vision- with up to 90% paid by the companyBasic Dental Insurance is free to the employeeQuarterly and Annual BonusesShares of company stock awarded annually in agreement with the Employee Stock Ownership Plan (ESOP)Paid Major National Holidays OffEmployee Assistance Program401K Saving PlanProfessional development opportunities.Incredible discounts on Company ProductsCasual Dress attireAs a Certified Evergreen company, we have found that nurturing a workforce motivated by our purpose and culture builds a rock-solid foundation. We take care of our people, and they take care of our customers, distributors, communities, and families.If you’re an energetic, collaborative person who wants to make a positive dent in the universe while helping others live their best lives, we want to hear from you!At Life’s Abundance, we don’t just accept differences - we celebrate, support, and thrive on them to benefit our employees, products, and communities. Life’s Abundance is proud to be an equal-opportunity employer."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/business-analyst-at-hackajob-3854153588?position=21&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=A1JbIr%2BBN2jLYGRtWYKmIg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Business Analyst",
            "company_name": "hackajob",
            "location": "Dallas, TX",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 36,
            "about": "hackajob has partnered with a global management and technology consultancy dedicated to the financial services and energy industries. We’re looking for Business Analysts to join the team in Dallas.Role: Business AnalystLocation: Dallas, TXWork model: hybridSalary: up to $105KResponsibilities:Develop and evaluate procedures, controls, user requirements and functional specifications to identify gaps between the current state and future stateCreate business requirement documents (BRD’s)Document and explain problems and work to resolve technical defects while ensuring technical compatibility and end-user satisfactionAnalyze, develop and propose enhancements to current business processes, reports and applications in order to optimize system effectivenessAssist in conducting customer interviews and producing meeting summariesProduce high-quality verbal and written consulting deliverables (proposals, customer presentations, consulting reports) to effectively communicate project findingsRequirements:3+ years of experience working as a Business AnalystExperience working for a management and/or technology consulting firm highly desiredSystem implementation experience nice to haveAbility to determine business objectives by reviewing business functions, gathering information, and evaluating output requirements and formatsAbility to research, review, and analyze the effectiveness and efficiency of existing requirements-gathering processes and develop strategies for enhancing or further leveraging these processesExperience working with project stakeholders and project team to prioritize collected requirementsStrong PowerPoint and Excel skillsAbility to review data requirements and map to system fieldsAbility to monitor and communicate project progress by tracking activity, resolving problems, publishing progress reports, and recommending actionsIf you're interested in finding out more about this fantastic opportunity please get your application in and we can arrange a call.hackajob is a recruitment platform that will match you with relevant roles based on your preferences and in order to be matched with the roles you need to create an account with us.*This role requires you to be based in the US*Seniority LevelMid-Senior levelIndustryTechnology, Information and MediaEmployment TypeFull-timeJob FunctionsInformation TechnologySkillsPython (Programming Language)Azure Data LakeData LakesSnowflakeLeadershipTeam LeadershipData ScienceMicrosoft Excel"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/executive-director-at-camille-a-brown-dancers-cabd-inc-3854120852?position=22&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=vWtdbaEM89kQKWJYLViTYw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Executive Director",
            "company_name": "Camille A. Brown & Dancers (CABD, INC.)",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "BACKGROUNDFounded by prolific choreographer and Artistic Director Camille A. Brown, and incorporated as a nonprofit in 2017, Camille A. Brown & Dancers (CABD) is a Bessie award-winning, NYC-based performing arts organization. Committed to implementing and advancing Camille A. Brown’s artistic vision, CABD creates and presents performances, offers dance engagement activities through its Every Body Move program, and investigates historical and contemporary cultural, personal, and social justice issues through the art of dance theater and other performing art mediums. Its mission is to provide a multi-faceted platform for sharing and building an understanding of and appreciation for the African American experience by fostering interaction and dialogue among diverse communities within its NYC hometown, across the country, and globally.POSITION SUMMARYThe Executive Director (ED) is a vital member of CABD’s three-member Executive Leadership Team, which is led by the Founder & Artistic Director (AD) and includes the Director of Artistic Planning & Producing (DAPP). The ED oversees administrative departments and day-to-day administrative operations, including Finance, Operations, Human Resources, Development, Communications, and Board Governance. The DAPP oversees artistic departments and day-to-day artistic operations, serving as the AD’s proxy in this regard. The ED and DAPP partner closely and regularly connect with the AD to advance the organization in an aligned manner.The ED is responsible for the administrative leadership and skillful management of CABD with a focus on organizational culture, team management, fundraising, and oversight of the operating budget (currently $1.8M). This position calls for a highly collaborative, organized, and motivated leader who is excited to co-develop and implement a holistic vision for CABD’s future, given the organization’s recent, notable growth and the opportunity created by the breadth of Camille A. Brown’s artistic projects outside of the nonprofit dance world. The ED will be encouraged to build upon CABD’s existing foundation, with the freedom to evolve systems, practices, and priorities in partnership with the staff. It’s also anticipated that CABD will engage in a strategic planning process in the near future, which the ED will help spearhead.RESPONSIBILITIESStrategic LeadershipCollaborates with the Executive Leadership Team (AD, ED, DAPP) and Board of Directors to identify and achieve organizational goalsIn partnership with the DAPP, centers and advocates for the AD’s vision across organizational decision-making, priorities, and practices—both internally and externallyServes as the administrative leader on the Executive Leadership Team, with final say and oversight of matters related to the operating budgetand all administrative departments and activitiesIn partnership with the Board Chair, manages Board relations, meetings, and giving, further advancing Board development, recruitment, onboarding, and active participationEngages in weekly meetings with the DAPP and regular meetings with the Executive Leadership Team (including the AD) to uphold communication and aligned leadershipHelps spearhead an upcoming, anticipated strategic planning process in partnership with the Board, Executive Leadership Team, staff, and an external ConsultantOrganizational Culture & Human Resources LeadershipProvides strong, effective, positive, and empathetic leadership for CABD staffPromotes a healthy organizational culture where cross-functional collaboration, transparency, and staff contributions are valuedModels high standards of performance, teamwork, and collegiality, and holds staff responsible for maintaining these standardsSupervises all budget-related decisions, including those posed by the AD and DAPPSupervises and, as needed, recruits an administrative team appropriate for the needs of the organization; currently this team includes three (3) full-time staff (Director of Finance & Operations, Director of Community Engagement & Education, & Development Officer) and three (3) part-time staff (Social Media Coordinator, Community Engagement Program Associate, & Administrative Associate)Supports staff in their careers, ensuring that they are provided with regular feedback, opportunities for professional development, and clarity on professional growth at CABDOversees and implements HR activities including approving payroll, coordinating employee benefits, issuing employee contracts, and developing policies and proceduresBuilds upon, formalizes, and streamlines personnel management and HR practicesSupports the DAPP in the negotiation and development of artistic contracts, as neededFinancial & Operational LeadershipFiscally manages the organization, developing and leading the annual operating budget and overseeing the annual audit, organizational investments, and cash reservesPartners with the Board Finance Committee, and full Board, on organizational financial oversight and monitoring, providing timely updates, reports, and recommendationsIdentifies earned/contributed revenue opportunities and engages staff to advance themCodifies operational policies and procedures, evaluating and improving them with the goal of increasing clarity, efficiency, and equityOversees the Community Engagement & Education Program (Every Body Move), advising and facilitating activities as the department needsSupports the AD and DAPP with various artistic projects and programs, as neededDevelopment & Communications LeadershipLeads the efforts to generate contributed revenue (currently ~$1.3M) by developing, overseeing, and supporting the implementation of the annual fundraising strategyServes as the organization’s frontline fundraiser and organizational relationship-builder, soliciting gifts, developing grants, cultivating relationships, and identifying opportunitiesEdits and approves grant proposals, budgets, and reports and, at times, develops these materials independentlyCreates and implements an individual giving and major gifts program above and beyond the annual appealActivates, guides, and prepares the Board as ‘friendraisers’ and fundraisersPartners with the DAPP and staff on cultivation/special event strategy and oversightSupervises grant compliance, supporter recognition, gift documentation and acknowledgement, prospect research, and supporter stewardshipDevelops copy for programs, e-newsletters, appeals, invitations, ads, brochures, and other marketing collateral, as needed, and/or edits and approves staff-developed copyPartners with the Executive Leadership Team, CABD press agent, and theater PR team on all external announcements, press releases, and pitchesIDEAL QUALIFICATIONSAs a Black, female-led organization, CABD is committed to building inclusive teams that reflect the diversity of its work and community. The qualifications denoted below are ideal. Individuals who don’t meet 100% of these ideal qualifications, but have transferable skills or experience, are strongly encouraged to apply.Ability and willingness to lead within a collaborative leadership environment, working in partnership with the DAPP and centering the vision of the Founder & Artistic DirectorDemonstrated commitment to the complexities of the BIPOC experience, working toward inclusion and shaping an equitable and inspiring work environmentExperience in and understanding of the nonprofit dance sector; additional performing arts (nonprofit theater, commercial theater, opera, etc.) experience is highly preferredSignificant nonprofit fundraising experience, from gift strategy to close, across the areas of grants/institutional giving, individual/major giving, and special eventsExperience managing and/or leading Human Resources, with a focus on personnel management and HR equitable practice and policy developmentExecutive management experience with significant external and internal responsibilitiesProven financial acumen at a program/departmental or, ideally, organizational levelClear understanding of Board Governance and Board development strategiesComfort building and cultivating strong, trusting relationships internally and externallyTrack record of developing teams with collaboration and transparency at the helmExperience strategically navigating an organization/department/program through a stage of growth, inflection point, or formal strategic planning process is a plusRelevant educational background or equivalent work experience is required; a degree in a relevant field (e.g., business administration, nonprofit management, etc.) is a plusCOMPENSATION & BENEFITSThe salary range for this position is $95,000 - $105,000, commensurate with experience. Health insurance (medical, dental, and vision) andgenerous PTO are offered, including 4 weeks of vacation, 20.5 paid holidays (inclusive of a week-long organization-wide break), 4 personal days/floating holidays, and 5 sick days. CABD has also intentionally made this role a remote position, with select in-person activities expected, to allow for greater flexibility.APPLICATION INSTRUCTIONSTo be considered, please submit your application electronically as one (1) PDF document tojobs@camilleabrown.orgwith “Executive Director” in the subject line. Applications are requested by or beforeMonday, April 15and will be reviewed in the order received.Applications should include: a resume, a cover letter highlighting your interest and qualifications, and at least three (3) professional references.All applications will be treated as confidential, and references will not be contacted without the candidate’s advance knowledge and agreement. Incomplete submissions will not be considered nor will submissions that are sent via postal mail, fax, or phone."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/director-of-operations-at-career-opportunities-international-3854127555?position=23&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=rHmitMAVpX9DIbNQ3cpeHQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Director of Operations",
            "company_name": "Career Opportunities International",
            "location": "Dallas-Fort Worth Metroplex",
            "seniority_level": "Director",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 120,
            "about": "Company OverviewOur client is a prominent and globally recognized company in the contract manufacturing electronics industry with a robust and well established global presence, and a stablished reputation for operations excellence and highest customer satisfaction across continents. As part of their strategic expansion projections, they are actively seeking a highly accomplished Director of Operations to guide their multisite operations within the United States.Additional information will be given to qualified candidates.Title:Director of Operations, Multisite (on-site role)Location:Dallas, TexasReports To:Chief Operations OfficerThe PositionOur confidential client is looking for an experienced Director of Operations for a growing and leading company in its industry.This is an outstanding opportunity for an energetic and self-driven individual, able to perform in a highly complex and fast-paced environment and bring the operation to the next level. This position is responsible for upholding the profitability of the organization by leading business operations, meeting sustainable growth expectations, and aligning their responsibilities with the Company’s mission, values, and strategic goals.The Director of Operations will manage several departments in a multisite operation, including staff, and projects which will require strong financial acumen to manage the P&L responsibility. Plant Management experience is highly preferred, managing the entire value chain of operations, including Materials Management, Industrial Engineering, Planning, Logistics, Buying, Production, Testing and Quality Control, as well as Warehouse.Other key duties of this position involve building and developing high-performing work teams, fostering a culture of accountability, collaboration, and continuous improvement.Duties and ResponsibilitiesDevelops, communicates, and implements the road map for the Operation, with measurable goals that are aligned with their global strategyImplements and runs KPI management in the areas of costs, quality, delivery, and flexibility (P&L responsibility of US operations hub)Champions continuous improvement and waste elimination through specific cost reduction and efficiency-based initiatives, maintaining and controlling CAPEX and OPEX budgetResponsible for meeting and achieving internal and external customer expectations for timely delivery and product quality, day-to-day product demands and new product introductionsMonitors inventory levels to support adequate supply of raw materials, work-in-progress inventory, and finished goodsDocuments and monitors processes to eliminate variation, promoting sharing of best practicesSelects, develops, and leads a diverse high performance team of employees capable of meeting company targets in a fast paced evolving atmosphere, providing leadership for employee relations through effective communications, coaching, training, and developmentEnhances and implements production & logistics business processes collaborating with the global process owners.Establishes strong new product introduction (NPI) competenceSupports and implement global strategic initiatives (business process harmonization, standardization, digitization and automationOversees the implementation of new manufacturing technologies to improve efficiency and productivity in collaboration with global manufacturing and technology teamFosters and sustains a team-oriented culture of collaboration and open communication within the department and across functions throughout the organization, leading the team with a Safety first mindsetQualificationsBachelor’s degree in the engineering field. Master’s degree preferred10+ years' leadership experience in an electronics industry at upper leadership level, managing global electronics service provider or with strongElectronics Manufacturing background. PCBA Production experience (printed circuit board assembly).Experience in Contract manufacturing operations is a significant plus.Digitization, Robotics & automation (SAP, MES)Lean manufacturing, six sigma concepts (track record of implementation projects)Strong strategic, influential and business process leadership mindset to create, communicate and implement the right road map, share a common vision and directionSolid analytical and problem-solving skillsResults-oriented focus on cost reduction and operational efficiency with an agile mindset and data driven decision making (KPI’s management)Outstanding change management skills with proven experience anticipating growth and leading transformation in a fast pace growing environment. Embracing change with a positive attitude and a crisis management approach, strong enough to turnaround the operation, sharing and sponsoring best practices along the roadExcellent verbal and written communication skills at all levels inside and out of the organizationOrganizational agility to build strong relationships and relate functions across the organizationExtensive project management and process optimization experience driving results in an evolving unstructured setting with the right sense of urgencyProven talent management experience leading and developing high performance teamsResilient and entrepreneurial spirit"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854108853?position=24&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=tJqGXnOP7Z%2FrxwlXRLrU8g%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Fort Wayne, IN",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRZwM5CF6W5N"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/customer-service-representative-group-travel-remote-at-navigate-new-horizons-3854109818?position=25&pageNum=0&refId=mr%2B3wNo8TVX68hNKt9qqIQ%3D%3D&trackingId=zPup0THnqT3ujqi%2BIDOY3Q%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Customer Service Representative /Group Travel (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "About Us: Our company is a dynamic and innovative travel company specializing in group travel experiences. We are seeking a Remote Group Travel Customer Service Representative to join our team. In this role, you will be responsible for delivering exceptional customer service to group travelers and ensuring their journeys are smooth and memorable.Key Responsibilities:Customer Assistance:Provide timely and friendly assistance to group travelers through various communication channels (phone, email, chat) to address their inquiries, resolve issues, and offer guidance.Booking Support:Assist customers with booking group travel arrangements, including flights, accommodations, transportation, and activities, ensuring accuracy and compliance with company policies.Itinerary Management:Create and update travel itineraries, taking into account group preferences, budget constraints, and destination-specific information.Problem Resolution:Proactively identify and resolve any travel-related issues, such as flight delays, accommodation changes, or cancellations, to minimize disruptions and maintain customer satisfaction.Communication:Maintain open and clear communication with group leaders, travel coordinators, and suppliers to ensure a smooth and seamless travel experience.Travel Documentation:Assist travelers in obtaining necessary visas, permits, and travel documents, ensuring they comply with international regulations.Destination Knowledge:Stay updated on travel trends and destination information to provide valuable recommendations and insights to customers.Quality Assurance:Ensure the accuracy of bookings and travel documents, cross-checking details to prevent errors or oversights.Record Keeping:Maintain detailed records of customer interactions, travel arrangements, and relevant communications in the system.Team Collaboration:Collaborate with other departments, such as sales and marketing, to contribute to the success of group travel programs and provide feedback for continuous improvement.Qualifications:Previous customer service experience, ideally in the travel industry a plus but not required.Strong communication skills, both written and verbal.Excellent problem-solving abilities and attention to detail.Knowledge of travel booking systems and tools is a plus but not required.Ability to work independently and as part of a remote team.Passion for travel and a desire to create memorable experiences for customers.Benefits:Flexible ScheduleCommission basedTravel PerksBusiness OpportunityLicensed & BondedPersonal WebsitePowered by JazzHRsMX3q4vEIa"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854113341?position=1&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=0l2kBjedLc4SB2NeDzDGjQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Colorado Springs, CO",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRJcbtWX7zvQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854110764?position=2&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=0YNRnD6NMsyoRG9wfCQ%2Fnw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Are you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryThis opportunity is available for candidates within the USA, Mexico and Australia and United KingdomPowered by JazzHRrQqNzTr0HK"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854110768?position=3&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=sJ4hbRvKa76WvKVNsgUo5Q%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "California, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity 1009 Commission Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, Australia, MexicoPowered by JazzHRWOh4KOwwjX"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854109807?position=4&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=EPeQIHHOEjWkk86DO7aPCA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Position: Home-Based Reservation Agent - Thriving Business Opportunity in the Travel IndustryAre you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryNote: This opportunity is available for candidates within the USA, Mexico and AustraliaPowered by JazzHRe8s4AC5jHQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854111595?position=5&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=2V%2BPyXNAv5Uc0KdC%2BZIcGw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Minnesota, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRvyygM3g5OP"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-event-planner-entry-level-at-navigate-new-horizons-3854110777?position=6&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=qV6VvLO53Drez3gHAoH7xA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online- Event Planner/Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "This is a remote position. We are searching for highly self-motivated and entrepreneurial-minded people who will benefit from creating a flexible work schedule that has the potential to give the life-work balance youve always wanted. Workaround family commitments and have time for your passions. Live where you want and say goodbye to commuting.About Us:We work with Companies that require our services for planning, scheduling, organizing and coordinating company events, seminars, team building events or gatherings and other company related requirements. Full training and ongoing support are providedDuties and Responsibilities:The duties and responsibilities of an Event Planner require the ability to communicate well with customers and venues. Event planners must pay careful attention to detail using information from several sources to plan a successful event. Other Event Planner responsibilities include:Listening attentively to customer requests and keeping records of these requestsManaging and budgeting customer financesSelecting an appropriate venue suitable for the type of eventHaving good knowledge of geographic locations and their main attractionsOrganizing audiovisual equipment in advanceCoordinating hotels, transportation and foodAttending and monitoring activities to ensure client satisfactionReviewing bills and approving paymentsFollow a turn-key business model and strategy.Identify and develop niche target markets. You can book sports, concerts, car, air, hotels, all-inclusive resorts, cruises etc. or book any of these categories, you choose.Research, plan, and present a quote to clientsWork directly with suppliers such as Expedia, Golden Tickets, Norwegian Air, Hertz, etcOnce the itinerary for an Event is agreed on, collect credit card payments and send email confirmations Make changes if needed to book Events.Requirements:Professional phone and email communication.No experience necessary, we will train you.The ability to work independently with full support of a team and trainingNeed a laptop or smart phone and WI-FIRemote OpportunityMust be proficient in English, Bilingual a plusBenefits:Flexible SchedulePersonal WebsiteDaily Training AvailableRemote Opportunity Business OpportunityAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Bolivia, Chile, Colombia, Costa Rica, Ecuador, Panama, PeruThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business Opportunity This is NOT a job.Join our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRHq3UlalUoM"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854109813?position=7&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=5T7onI8k8zBFvG2cUG%2FMng%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, AustraliaPowered by JazzHRYyEDI0QMC6"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-at-navigate-new-horizons-3854110775?position=8&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=ubmhqdIDZYRlaU6Pww48ZQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant",
            "company_name": "Navigate New Horizons",
            "location": "Dayton, OH",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Passion for travel draws many to this field, but for success as a Travel Scheduling Assistant, one must embrace not just the allure of travel but also the vast opportunities it offers in connecting histories, cultures, and cuisines. Thriving in this role demands a robust sales acumen, impeccable organizational prowess coupled with a keen eye for detail, adeptness in multitasking within a dynamic environment, proficiency in computer navigation and software applications, as well as effective written and verbal communication skills, all while maintaining a commitment to continuous learning.At our company, we seek individuals who resonate with our values and are eager to push their boundaries both personally and professionally, individuals who are driven by a passion for service and making a meaningful impact on others' lives.Here's an incredible business opportunity to curate dream vacations and craft cruise itineraries with the industry's leading names!Description:Arrange Cruise Travel for vacations, honeymoons, weddings, and more.Determine customer's needs and preferences, such as schedules, costs, and payment plans.Plan and arrange tour packages, excursions, and day trips.Book reservations for travel, hotel, flights, rental cars, special events, and honeymoons.Benefits:Full Training Provided.Flexible Work Hours - Part-Time or Full-Time.No Prior Experience Necessary.Travel Perks Available.Licensed & Bonded.Personalized Website Provided.Access to Daily Training Sessions.Certification Opportunities Offered.Remote Business Opportunity.Requirements:Must be 18+.Computer with good WiFi.Self-Motivated.Detail-Oriented.Customer Service Skills are a plus.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. This is a 1099 Business Opportunity. Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRPyWyeo79kn"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-administrator-at-discover-the-world-global-3854120203?position=9&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=Zyozfy0bG%2BNM461xVgEPHw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Administrator",
            "company_name": "Discover the World - Global",
            "location": "United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Global HR AdministratorWe are looking for a motivated and enthusiastic Global HR Administrator to join our team!Our people are our greatest asset, and you will lead by delivering a positive experience for our teams, offering friendly customer service along with a sense of urgency.You will serve as the main point of contact companywide, supporting both employees and department heads in HR related duties ranging from onboarding to answering enquiries such as payroll questions, benefits, employee records, and time tracking. You are skilled at handling employee information with the sensitivity and confidentiality it deserves.You will have experience in multi-country payrolls, with working experience in the USA and United Kingdom, being the most essential. You will work with our payroll vendors and help us streamline processes and improve our ability to centralize global payroll activities and reporting.Responsibilities:Participate and coordinate employee onboarding. You will ensure a smooth process of new hires from creating new employee records, explaining, and setting up employee benefits, reviewing company policies, and gathering payroll information such as withholding, and getting signatures on documents.Lead and coordinate collection of all employee documents and records across multiple countries. ensuring accurate employee records by recording hiring, transfers, terminations, change in job classifications, merit/bonus dates, and tracking time off such as vacations and sick time.Oversee and protect confidential information such as employee records, compensation, issues, and any sensitive information.Secure and review benefits annually such as healthcare and retirement/pension providersManage end-to-end payroll processes for multiple countries (starting with the USA & UK) including data collection, calculations, and disbursements, to ensure accurate and timely payments.Work closely with accounting teams to make sure payroll is accurately funded each month.Provide payroll and employee reports to leadership team.Collaborate with payroll service providers and vendors, ensuring service levels meet established standards. Manage relationships to optimize payroll processes and resolve any issues.Identify opportunities for streamlining payroll processes and payroll reports, and vendors.QualificationsExperience in handling employee onboarding, record keeping and benefit analysis.A minimum of 2 years of multi – country payroll experience. Experience with ADP and knowledge of ADP global payroll capabilities preferred.Ability to work independently and ensure all payrolls are done on time and accurately.Excellent people skills (written and verbal).Ability to balance multiple projects simultaneously, is flexible, enjoys collaborating with other teams and is deadline driven.Proficiency with data analysis, - Microsoft Excel & knowledge of Microsoft Office,Certifications in CPP or FPC payroll are a plus, but not required."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/remote-hotel-reservationist-entry-level-at-navigate-new-horizons-3854109809?position=10&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=8NeJx3Yzp4iKNcXK8Pke%2BA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Remote Hotel Reservationist-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We are actively searching for an individual with meticulous attention to detail and a customer-centric mindset to join our team as a Remote Hotel Reservationist. If you possess outstanding communication skills, radiate warmth, and harbor a genuine passion for hospitality, we extend a warm invitation for you to become part of our team today! Comprehensive training will be provided.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests through phone, email, and in-person, addressing reservation inquiries, changes, and cancellations.Assist guests during check-in and check-out, ensuring a seamless process and attending to special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as necessary.This remote position offers the flexibility to work from the comfort of your home or any location with an internet connection. We value the importance of work-life balance, enabling you to manage your workload in alignment with your lifestyle.As a Remote Hotel Reservationist, you have the opportunity to take control of your financial future. This isn't just a job; it's a chance to establish your own business within our framework. Determine your income potential, and we'll provide the support and resources to help you succeed, transforming your passion into a flourishing career.Benefits:Remote position with a flexible work environment.Competitive salary.Travel perks and discounts for personal and professional travel.Free training.Familiarization (FAM) Trips.Supportive team.Qualifications:Excellent communication and interpersonal skills with a courteous and welcoming demeanor.Organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and collaboratively as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.Must be 18 years or older.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHR74px60orKF"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/marketing-consultant-at-swell-partners-3854131156?position=11&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=2KEGiHcVhGUPhrHq2euYpw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Marketing Consultant",
            "company_name": "Swell Partners",
            "location": "New York, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Contract",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Our client, a healthcare technology company, is looking to hire a Marketing Consultant, who will join the Strategic Client and Segment Growth Marketing team, concentrating on implementing engagement strategies to boost consumer adoption and generate revenue growth. This pivotal role requires strategic insight coupled with operational prowess, collaborating extensively with cross-functional teams and clients to bolster member engagement and deepen client relationships. The ideal candidate will possess a robust B2B2C marketing background, exemplary client management capabilities, and a fervent interest in advancing healthcare innovation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854112372?position=12&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=AX5PXyFsFThpltFnvdp7gA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Tacoma, WA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRPQxB4cJH7W"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-hotel-reservationist-entry-level-at-navigate-new-horizons-3854114255?position=13&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=vwbBreNpJ3KZsKz3YYht4g%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Hotel Reservationist-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Florida, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "We are currently seeking an individual with a sharp attention to detail and a customer-focused mindset to join our team as a Hotel Reservationist. If you have outstanding communication skills, radiate warmth, and harbor a genuine love for hospitality, we invite you to become a part of our team today!Responsibilities:Handle hotel reservations, addressing inquiries, processing bookings, and verifying room availability.Engage with guests through phone, email, and in-person interactions, handling reservation inquiries, modifications, and cancellations.Assist guests during check-in and check-out, ensuring a smooth process and addressing any special requests or concerns.Collect payment details, process reservations, and issue invoices or receipts when necessary.This remote role offers you the flexibility to work from your home or any location with internet access.We understand the importance of work-life balance, empowering you to manage your workload in a manner that suits your lifestyle.As a Hotel Reservationist, you have the chance to take control of your financial future. This isn't simply a job; it's an opportunity to establish your own business within our framework. You can determine your earning potential, and we'll provide the guidance and resources to assist you in succeeding, transforming your passion into a thriving career.Benefits:Remote role with flexible work arrangements.Travel perks and discounts for personal and professional use.Complimentary training.Familiarization (FAM) Trips.Supportive team environment.Qualifications:Excellent communication skills and a friendly, courteous demeanor.Strong organizational skills and ability to multitask effectively.Attention to detail and commitment to accuracy.Capable of working independently and collaboratively within a team.Thorough knowledge of travel destinations, attractions, and various travel products and services.Outstanding customer service and problem-solving capabilities.Passionate about travel and dedicated to helping others create unforgettable experiences.Must be at least 18 years old.This entry-level opportunity serves as your introduction to the dynamic realm of the travel industry. Taking this initial step enables you to positively impact the lives of travelers while nurturing your professional development. Explore the world, one extraordinary experience at a time – start your entrepreneurial journey today. 1099 Business Opportunity.Join our team now to unlock your freedom and embark on your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRtWZwcAEAVx"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/chief-business-officer-at-the-crox-group-3854162687?position=14&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=EMB3BpUkS8aSR05Zv3l9QA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Chief Business Officer",
            "company_name": "The Crox Group",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "Role: Chief Business Officer/ Chief Growth OfficerLocation: Green Bay, WI (Remote)Job Type: Full Time PositionJob SummaryReporting to the CEO, this position will partner with the executive team and business unit leaders, as well as interact with members of the Board, to develop and drive organic and acquisition growth strategies and initiatives within the corporation and its affiliated companies, resulting in the achievement of our profitable growth and client stability goals. This position will be based out of the Green Bay, Wisconsin location with professional flexibility.Primary ResponsibilitiesActively participate in strategic planning and forecasting process to align the organization’s business strategies and long-term initiatives with profitable growth and client stability goalsPartner with CEO and business unit leaders to determine effective sales organization design, engage in selection of new team members (market leaders, client leaders, business development leaders) and related third-party resources, and maintain dotted-line relationship with sales and marketing team members across all companiesChampion the development, implementation, and effective application of sales and marketing practices and standard work processes/tools across all companies (e.g., brand/marketing standards, sales/marketing planning, sales process, proposal standards, presentation standards)Research/identify new markets, services, and delivery method opportunities in coordination with business unitsIdentify/leverage cross-selling opportunities between business unitsSponsor training and development initiatives supporting the development of the sales organization, including sales process, client negotiations, project pricing, portfolio management, and risk managementIn support of business unit client relationship activities, effectively engage with key clients, to include reviews of proposals and presentations, attending selected conferences, and participating in client partnership meetingsTravel to client sites and/or other local offices as neededAct as a role model to fellow members by demonstrating behaviours consistent with our brandRequired QualificationsBachelor’s degree in business, engineering, or related technical field15+ years of experience driving strategic growth in P&L leadership capacity for a mid-sized or larger company or significant business unit, including leadership of high-growth sales teams/functions.Preferred QualificationsEngineering degree and/or professional engineering license.Master of Business Administration.Knowledge of the markets in which company does business.Previous responsibility for marketing functions.Experience in a professional services/consulting environment.Mergers & Acquisitions (M&A) experience."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/junior-frontend-engineer-javascript-html-css-at-team-remotely-inc-3854140927?position=15&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=1abC9RvnHVqtkjjHTlNcGQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Junior Frontend Engineer (JavaScript/HTML/CSS)",
            "company_name": "Team Remotely Inc",
            "location": "Charlotte, NC",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 12,
            "about": "This is a remote position.Junior Frontend Engineer (JavaScript/HTML/CSS)(1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.Hiring Type:Full-TimeBase Salary:$62K-$72K Per Annum.ResponsibilitiesAutonomy of project implementationEfficient in coding reviewReporting directly to ownersAgile work-flowBuilding customer-facing applicationsMeta-development opportunitiesThe Successful ApplicantFront-end web experience coding in JavaScript/HTML/CSS.Willing to mentor junior talent.Eager to move into a lead role with rapid expected company growth.Comfortable working in a remote role.A dependable individual who can take initiative on cleaning up and expanding projects.Benefits:Competitive salary and benefits package.Remote work flexibility! Enjoy the freedom and convenience of working from anywhere with a stable internet connection.Opportunity to work on challenging and impactful projects that drive business results.Collaborative and supportive work environment.Continuous learning and development opportunities."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/online-marketing-specialist-entry-level-at-navigate-new-horizons-3854112380?position=16&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=4MJvy84VI8Z4UxYC2w1LMA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Online Marketing Specialist -Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Language: Must have English proficiency, Proficiency in a second language is advantageous.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Available in USA, United Kingdom, Argentina, Australia, Mexico, Columbia, Costa Rica, Ecuador, Panama, PeruPowered by JazzHRhow2WhXsNk"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/buyer-women-s-west-coast-at-brunello-cucinelli-3854175748?position=17&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=sEG%2FB471vv%2BLtvM9HHsfmw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Buyer, Women's - West Coast",
            "company_name": "Brunello Cucinelli",
            "location": "Los Angeles Metropolitan Area",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 36,
            "about": "About us:\"Those who work with us take part in the company’s life. Everybody knows that their work is an indispensable contribution to our shared growth \"– Brunello CucinelliBrunello Cucinelli, founded in 1978 by the eponymous designer and entrepreneur, is an Italian house operating in the absolute luxury sector, specializing in cashmere and the international informal luxury ready-to-wear sector. As a perfect blend of industry and craftsmanship, our products are designed to stand the test of time. The whole world is fascinated by the products of our country, by the careful selection of raw materials, and the search for the highest quality and creativity in every step of the production chain.Today, the Brunello Cucinelli company finds its true meaning and aesthetic pursuit in manual skills, craftsmanship and the exclusivity of its collections. They are the truest expression of humanity and of creativity and, as such, are fundamental to us.Who you are:The Women's Buyer is a key component in the success of our stores. As a member of the Buying team, the Buyer is responsible for ensuring success in all assigned categories of business for the West Coast doors. The ideal candidate possesses strong analytical skills, can creatively problem solve, and thrives in an entrepreneurial environment.What You’ll Do:Work with Buyer to understand departmental strategies and key goals for the seasonParticipate in seasonal assortment planning for stores, building strong relationships with retail store managers and cross-functional partners to discover missed opportunitiesBuilds and updates seasonal assortment sheets, line plans, and item SKU listsPrepare and maintain reporting and analysis such as best sellers, opportunities, and market reporting by style, category, doorAssist in order management and continued ownership of order files to ensure accurate rollout to all doorsManage all special-order requests relative to monobrand businessAssists with product transfersCompletes reports and recaps and communicates trends and financial metrics to key stakeholders including management, planning team, and international partnersAnticipates inventory opportunities, communicates recommendations, and takes corrective action with the guidance of buyer to solve problems and correct deficienciesCreates materials for store product knowledge seminars and participates in local clinics and eventsAdditional duties as assignedQualifications:Bachelor’s degree in fashion merchandising preferred3-5 years experience in a related role, preferably with a luxury brandProficient use of Microsoft Office products including Word, Excel and OutlookStrong retail math, analysis & financial planning skillsStrong sense of urgency and ability to problem-solveSets high standards for self; discusses goals with Buyer and achieves goalsConsistent demonstration of professionalism, sound judgment, and integrityMotivated and able to work well independently, as well as an effective member of a teamAbility to multi-task and provide timely follow-upEEOCBrunello Cucinelli is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status, or any other characteristic protected by law."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/custom-travel-planning-assistants-virtual-at-navigate-new-horizons-3854111598?position=18&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=aX%2BCar0C1G3PgbMSUx0GkA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Custom Travel Planning Assistants-Virtual",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We're seeking eloquent and engaging individuals to join our remote team. Our company's mission is to design unforgettable vacation packages that leave lasting impressions.As a valued team member, you'll demonstrate superb communication skills via phone, social media, and email to connect with and support clients in their vacation planning. This role not only offers personal growth potential but also the chance for financial independence and entrepreneurship. Collaborating closely with top-tier suppliers for cruises, resort stays, and events, you'll be part of a vibrant and supportive community.Responsibilities:Acquire supplier certifications to stay updated on industry developments.Work remotely, providing flexibility to manage your work-life balance effectively while delivering exceptional event experiences for clients.Enjoy the freedom to work from home or anywhere with internet access, recognizing life's unpredictable nature.Take charge of your financial future by establishing your own business within our framework.Determine your income potential with our support, turning your passion into a thriving career.Earn one of the industry's highest travel commissions based on successful bookings.Benefit from comprehensive training and ongoing development programs, equipping you with the skills to thrive in your role and beyond.Be part of a supportive community, collaborating with like-minded individuals passionate about the travel industry. Gain valuable experience by working on diverse projects, from corporate conferences to weddings and social gatherings.Utilize social media to maintain and market to your client base.Qualifications:Demonstrate knowledge and expertise in popular vacation destinations worldwide.Provide outstanding customer service with meticulous attention to detail.Utilize time management skills to research, plan, and book vacation packages for clients.Multi-task effectively while ensuring client satisfaction.Must be able to read /write English fluently. Bilingual a plusBenefits:Remote positionFlexible remote work environment.Competitive commissionTravel perks Discounts on personal and professional travel.Free training FAM TripsSupportive teamAvailable in USA, United Kingdom, Argentina, Australia, Mexico, Columbia, Costa Rica, Ecuador, Panama, PeruIf you're seeking more than just a job and envision building your own business within our organization, join us on this thrilling journey. We offer mentorship and guidance to help you succeed and create outstanding events for our clients. This is a 1099 Business OpportunityPowered by JazzHRJ5ggShII6y"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/entry-level-online-marketing-specialist-at-navigate-new-horizons-3854114280?position=19&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=VVniYyQtAM6OtWYQbrC6yw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Entry Level-Online Marketing Specialist",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Unlock the potential to channel your expertise in online marketing into a rewarding venture as an Online Marketing Specialist. Join our dynamic team through our host agency program, where you'll delve into the digital realm and provide invaluable marketing insights to our clients. As an Online Marketing Specialist, your role transcends traditional marketing strategies – it's about crafting impactful campaigns and connecting businesses with their target audience effectively.Become an Online Marketing Specialist – Thriving Business Opportunity with a Host Agency!Key Responsibilities:Digital Strategy Development: Dive into the world of online marketing, devising comprehensive strategies to enhance brand visibility and drive engagement across various digital platforms.Content Creation: Generate compelling content, including social media posts, blog articles, and email newsletters, to captivate audiences and foster brand loyalty.Campaign Management: Oversee the planning, execution, and optimization of digital marketing campaigns, ensuring alignment with client objectives and maximizing ROI.Analytics and Reporting: Utilize data analytics tools to track campaign performance, analyze key metrics, and provide actionable insights for continuous improvement.Benefits of Joining Our Host Agency:Comprehensive Training: Access cutting-edge training to hone your digital marketing skills, equipping you with the knowledge and tools to thrive in the competitive online landscape.Supportive Network: Collaborate with industry experts and leverage the resources and support provided by our host agency, fostering a community of shared learning and success.Flexible Work Environment: Enjoy the freedom to work remotely from anywhere with an internet connection, allowing you to maintain a healthy work-life balance.Commission Opportunities: Earn competitive commissions based on the success of your marketing campaigns, providing a direct correlation between your efforts and financial rewards.Qualifications:Passion for Online Marketing: Demonstrate a genuine enthusiasm for digital marketing trends, strategies, and technologies, with a desire to stay ahead of the curve.Analytical Skills: Possess strong analytical abilities to interpret data, identify trends, and make data-driven decisions to optimize marketing efforts.Creativity: Showcase creative thinking and innovative ideas to develop engaging content and campaigns that resonate with target audiences.Communication Proficiency: Exhibit excellent written and verbal communication skills to convey marketing concepts effectively and collaborate with clients and team members.Tech Savviness: Be proficient in using digital marketing tools and platforms, including social media management tools, email marketing software, and analytics platforms.Embark on a Journey of Success:As an Online Marketing Specialist with our host agency, you're not just executing marketing strategies; you're shaping brand narratives and driving business growth. Seize this business opportunity and let your passion for online marketing propel your entrepreneurial journey. Join our team today and be part of a community that celebrates innovation and creativity while empowering your growth in the dynamic digital landscape.Join Our Team NOW to Unlock Your Freedom and kickstart your Entrepreneurial Journey in Online Marketing.Powered by JazzHR2TbFar2BOq"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/hotel-reservationist-remote-at-navigate-new-horizons-3854111658?position=20&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=45R7bQGzvrpxuoduknC%2FYw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Hotel Reservationist-Remote",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We are actively searching for an individual with meticulous attention to detail and a customer-centric mindset to join our team as a Remote Hotel Reservationist. If you possess outstanding communication skills, radiate warmth, and harbor a genuine passion for hospitality, we extend a warm invitation for you to become part of our team today! Comprehensive training will be provided.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests through phone, email, and in-person, addressing reservation inquiries, changes, and cancellations.Assist guests during check-in and check-out, ensuring a seamless process and attending to special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as necessary.This remote position offers the flexibility to work from the comfort of your home or any location with an internet connection. We value the importance of work-life balance, enabling you to manage your workload in alignment with your lifestyle.As a Remote Hotel Reservationist, you have the opportunity to take control of your financial future. This isn't just a job; it's a chance to establish your own business within our framework. Determine your income potential, and we'll provide the support and resources to help you succeed, transforming your passion into a flourishing career.Benefits:Remote position with a flexible work environment.Competitive salary.Travel perks and discounts for personal and professional travel.Free training.Familiarization (FAM) Trips.Supportive team.Qualifications:Excellent communication and interpersonal skills with a courteous and welcoming demeanor.Organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and collaboratively as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.Must be 18 years or older.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRt6RtAN6DDc"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-generalist-at-life-s-abundance-inc-3854148722?position=21&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=HD0rjYtFPKXO7s40mVmqJg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Generalist",
            "company_name": "Life's Abundance, Inc",
            "location": "Jupiter, FL",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Join our Team of Employee Owners as a People and Culture Generalist!:Life’s Abundance is an employee-owned company, with a purpose of empowering people and pets to live healthier, happier lives. Since 1998, we've put our hearts into creating a positive impact on our team, our customers, our vendors, and the world community; with our employee owners being at the heart of everything we do. Our culture is vibrant, filled with energy, support, and a commitment to continuous improvement.As we continue to grow, it’s crucial that our culture does too. That’s why we need you! We're searching for a dynamic HR Generalist to play a key role within our People & Culture Department.If you believe that employees are a company’s most valuable asset and great workforce culture doesn’t happen without intention, keep reading. Critical component of the role is active and open collaboration with many departments, including the VP of Operations and the CEO.If you're passionate about making a meaningful difference and excited to work for a company where every employee has a stake in the success, we'd love to meet you!Responsibilities include:Partnering with the Executive team on decision-making concerning issues related to people and culture.Learning, understanding, and following the company’s methodology for hiring, onboarding, and offboarding employees.General HR responsibilities including benefits, investigations, time clock management, etc.Organizing and promoting our team-building activities across multiple locationsUnderstanding Life's Abundance culture and focusing on growing and improving it.Evolving and improving the People and Culture Department’s impact.Understanding and promoting employee ownership. Helping our employees understand and celebrate the benefits of working for a 100% employee-owned company (ESOP). Fostering an ownership mentality among our employee-owners.Improving employee training.Improving communication with employees about opportunities to advance their career within Life’s Abundance.Learner’s mindset with an interest in growing your knowledge in various HR facetsManaging the relationship between the company and our PEO ProviderWillingness and ability to travel domestically for professional development and team building.Life’s Abundance provides an ever-evolving opportunity for employee growth, and job responsibilities may be modified over time.What will make you a great fit:We are a technology-forward company, and being comfortable with cutting-edge technology, including AI, is a must.Strong people skills (naturally!)Active Listening - prioritizing understanding; responding with empathy and clarity.Strong verbal and written communication skills - ability to concisely and effectively communicate your thoughts and ideas to the team.Availability to work full-time, Monday through Friday.Experience with Kronos or similar TMSBachelor’s degree in HR, or a combination of experience and relevant certifications (SHRM CP/SCP, PHR)Previous supervisory experience is a plus but not required.An Abundance of Benefits:Paid Volunteer Time OffPaid Personal Time Off- because life happens, partial PTO is advanced on day 1.Medical insurance for the employee plus family that includes dental and vision- with up to 90% paid by the companyBasic Dental Insurance is free to the employeeQuarterly and Annual BonusesShares of company stock awarded annually in agreement with the Employee Stock Ownership Plan (ESOP)Paid Major National Holidays OffEmployee Assistance Program401K Saving PlanProfessional development opportunities.Incredible discounts on Company ProductsCasual Dress attireAs a Certified Evergreen company, we have found that nurturing a workforce motivated by our purpose and culture builds a rock-solid foundation. We take care of our people, and they take care of our customers, distributors, communities, and families.If you’re an energetic, collaborative person who wants to make a positive dent in the universe while helping others live their best lives, we want to hear from you!At Life’s Abundance, we don’t just accept differences - we celebrate, support, and thrive on them to benefit our employees, products, and communities. Life’s Abundance is proud to be an equal-opportunity employer."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/business-analyst-at-hackajob-3854153588?position=22&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=kvhCmwC4dQrqwoNZzoFz1A%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Business Analyst",
            "company_name": "hackajob",
            "location": "Dallas, TX",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "months_of_experience": 36,
            "about": "hackajob has partnered with a global management and technology consultancy dedicated to the financial services and energy industries. We’re looking for Business Analysts to join the team in Dallas.Role: Business AnalystLocation: Dallas, TXWork model: hybridSalary: up to $105KResponsibilities:Develop and evaluate procedures, controls, user requirements and functional specifications to identify gaps between the current state and future stateCreate business requirement documents (BRD’s)Document and explain problems and work to resolve technical defects while ensuring technical compatibility and end-user satisfactionAnalyze, develop and propose enhancements to current business processes, reports and applications in order to optimize system effectivenessAssist in conducting customer interviews and producing meeting summariesProduce high-quality verbal and written consulting deliverables (proposals, customer presentations, consulting reports) to effectively communicate project findingsRequirements:3+ years of experience working as a Business AnalystExperience working for a management and/or technology consulting firm highly desiredSystem implementation experience nice to haveAbility to determine business objectives by reviewing business functions, gathering information, and evaluating output requirements and formatsAbility to research, review, and analyze the effectiveness and efficiency of existing requirements-gathering processes and develop strategies for enhancing or further leveraging these processesExperience working with project stakeholders and project team to prioritize collected requirementsStrong PowerPoint and Excel skillsAbility to review data requirements and map to system fieldsAbility to monitor and communicate project progress by tracking activity, resolving problems, publishing progress reports, and recommending actionsIf you're interested in finding out more about this fantastic opportunity please get your application in and we can arrange a call.hackajob is a recruitment platform that will match you with relevant roles based on your preferences and in order to be matched with the roles you need to create an account with us.*This role requires you to be based in the US*Seniority LevelMid-Senior levelIndustryTechnology, Information and MediaEmployment TypeFull-timeJob FunctionsInformation TechnologySkillsPython (Programming Language)Azure Data LakeData LakesSnowflakeLeadershipTeam LeadershipData ScienceMicrosoft Excel"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/administrative-listing-assistant-at-russ-lyon-sotheby-s-international-realty-3854115341?position=23&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=KIfAf0RG9ofGJHuF6C5Crw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Administrative & Listing Assistant",
            "company_name": "Russ Lyon Sotheby's International Realty",
            "location": "Scottsdale, AZ",
            "seniority_level": "Entry level",
            "employment_type": "Contract",
            "about": "Job DescriptionFull-time hire in Real Estate Office needed!Thursday-Monday 7:30AM - 4:30PMLooking for someone who is:High energyPositiveBig smileDisciplinedCommittedFocusedPunctualIf inquiring please include answers to the following (do not simply send a Resume):Why do you feel you will be a good fit for this role?What are some of your long term goals?Do you have a reliable vehicle?Thank you,DavidResponsibilities:Listing Management:Coordinate the creation and maintenance of property listings on various platforms.Ensure accurate and up-to-date information, including property details, photos, and virtual tours.Communication:Serve as a liaison between agents, sellers, and other relevant parties to facilitate smooth communication.Respond to inquiries and requests for information from clients and potential buyers.Documentation and Paperwork:Prepare and organize all necessary documents related to property listings, such as contracts, disclosures, and agreements.Ensure compliance with legal and regulatory requirements.Scheduling and Appointments:Manage and schedule appointments for property showings, open houses, and inspections.Coordinate with agents and clients to find suitable time slots.Marketing Support:Assist in the development of marketing materials for property listings, including brochures, online ads, and social media posts.Implement marketing strategies to maximize property exposure.Database Management:Maintain and update databases with accurate and current information on properties, clients, and leads.Utilize customer relationship management (CRM) tools for effective organization.Client Services:Provide excellent customer service to clients by addressing inquiries, resolving issues, and ensuring a positive experience throughout the listing processHandle incoming phone calls & direct as necessaryOversee calendarOversee email + respond to emails as ableInput clients + notes into CRM accordinglyManage / oversee Driven campaignsQualifications:Education and Experience:High school diploma or equivalent is required; additional education in real estate, business administration, or a related field is a plus.Previous experience in real estate administration, coordination, or a similar role is preferred.Real Estate License:Possession of a real estate license is preferred but not required. If the candidate is not licensed, a willingness to obtain a license in the future may be considered.Administrative Skills:Strong organizational and administrative skills, with attention to detail.Proficient in using office software, including word processing, spreadsheets, and email.Communication Skills:Excellent verbal and written communication skills.Ability to effectively communicate with clients, agents, and internal staff.Non-Sales Orientation:Comfort and satisfaction with a non-sales role, focused on administrative and coordination tasks.Understanding and appreciation for the importance of supporting the sales team and facilitating smooth transactions.Customer Service:Strong customer service orientation with the ability to handle inquiries and provide assistance to clients in a professional manner.Team Collaboration:Ability to work collaboratively with a team of real estate professionals, including agents, administrative staff, and management.Tech-Savvy:Familiarity with real estate management software, CRMs, and other tools commonly used in the real estate industry.Market Knowledge:Basic understanding of real estate market trends and terminology."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/executive-director-at-camille-a-brown-dancers-cabd-inc-3854120852?position=24&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=401rJCURrrHXUfMake8oqw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Executive Director",
            "company_name": "Camille A. Brown & Dancers (CABD, INC.)",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "BACKGROUNDFounded by prolific choreographer and Artistic Director Camille A. Brown, and incorporated as a nonprofit in 2017, Camille A. Brown & Dancers (CABD) is a Bessie award-winning, NYC-based performing arts organization. Committed to implementing and advancing Camille A. Brown’s artistic vision, CABD creates and presents performances, offers dance engagement activities through its Every Body Move program, and investigates historical and contemporary cultural, personal, and social justice issues through the art of dance theater and other performing art mediums. Its mission is to provide a multi-faceted platform for sharing and building an understanding of and appreciation for the African American experience by fostering interaction and dialogue among diverse communities within its NYC hometown, across the country, and globally.POSITION SUMMARYThe Executive Director (ED) is a vital member of CABD’s three-member Executive Leadership Team, which is led by the Founder & Artistic Director (AD) and includes the Director of Artistic Planning & Producing (DAPP). The ED oversees administrative departments and day-to-day administrative operations, including Finance, Operations, Human Resources, Development, Communications, and Board Governance. The DAPP oversees artistic departments and day-to-day artistic operations, serving as the AD’s proxy in this regard. The ED and DAPP partner closely and regularly connect with the AD to advance the organization in an aligned manner.The ED is responsible for the administrative leadership and skillful management of CABD with a focus on organizational culture, team management, fundraising, and oversight of the operating budget (currently $1.8M). This position calls for a highly collaborative, organized, and motivated leader who is excited to co-develop and implement a holistic vision for CABD’s future, given the organization’s recent, notable growth and the opportunity created by the breadth of Camille A. Brown’s artistic projects outside of the nonprofit dance world. The ED will be encouraged to build upon CABD’s existing foundation, with the freedom to evolve systems, practices, and priorities in partnership with the staff. It’s also anticipated that CABD will engage in a strategic planning process in the near future, which the ED will help spearhead.RESPONSIBILITIESStrategic LeadershipCollaborates with the Executive Leadership Team (AD, ED, DAPP) and Board of Directors to identify and achieve organizational goalsIn partnership with the DAPP, centers and advocates for the AD’s vision across organizational decision-making, priorities, and practices—both internally and externallyServes as the administrative leader on the Executive Leadership Team, with final say and oversight of matters related to the operating budgetand all administrative departments and activitiesIn partnership with the Board Chair, manages Board relations, meetings, and giving, further advancing Board development, recruitment, onboarding, and active participationEngages in weekly meetings with the DAPP and regular meetings with the Executive Leadership Team (including the AD) to uphold communication and aligned leadershipHelps spearhead an upcoming, anticipated strategic planning process in partnership with the Board, Executive Leadership Team, staff, and an external ConsultantOrganizational Culture & Human Resources LeadershipProvides strong, effective, positive, and empathetic leadership for CABD staffPromotes a healthy organizational culture where cross-functional collaboration, transparency, and staff contributions are valuedModels high standards of performance, teamwork, and collegiality, and holds staff responsible for maintaining these standardsSupervises all budget-related decisions, including those posed by the AD and DAPPSupervises and, as needed, recruits an administrative team appropriate for the needs of the organization; currently this team includes three (3) full-time staff (Director of Finance & Operations, Director of Community Engagement & Education, & Development Officer) and three (3) part-time staff (Social Media Coordinator, Community Engagement Program Associate, & Administrative Associate)Supports staff in their careers, ensuring that they are provided with regular feedback, opportunities for professional development, and clarity on professional growth at CABDOversees and implements HR activities including approving payroll, coordinating employee benefits, issuing employee contracts, and developing policies and proceduresBuilds upon, formalizes, and streamlines personnel management and HR practicesSupports the DAPP in the negotiation and development of artistic contracts, as neededFinancial & Operational LeadershipFiscally manages the organization, developing and leading the annual operating budget and overseeing the annual audit, organizational investments, and cash reservesPartners with the Board Finance Committee, and full Board, on organizational financial oversight and monitoring, providing timely updates, reports, and recommendationsIdentifies earned/contributed revenue opportunities and engages staff to advance themCodifies operational policies and procedures, evaluating and improving them with the goal of increasing clarity, efficiency, and equityOversees the Community Engagement & Education Program (Every Body Move), advising and facilitating activities as the department needsSupports the AD and DAPP with various artistic projects and programs, as neededDevelopment & Communications LeadershipLeads the efforts to generate contributed revenue (currently ~$1.3M) by developing, overseeing, and supporting the implementation of the annual fundraising strategyServes as the organization’s frontline fundraiser and organizational relationship-builder, soliciting gifts, developing grants, cultivating relationships, and identifying opportunitiesEdits and approves grant proposals, budgets, and reports and, at times, develops these materials independentlyCreates and implements an individual giving and major gifts program above and beyond the annual appealActivates, guides, and prepares the Board as ‘friendraisers’ and fundraisersPartners with the DAPP and staff on cultivation/special event strategy and oversightSupervises grant compliance, supporter recognition, gift documentation and acknowledgement, prospect research, and supporter stewardshipDevelops copy for programs, e-newsletters, appeals, invitations, ads, brochures, and other marketing collateral, as needed, and/or edits and approves staff-developed copyPartners with the Executive Leadership Team, CABD press agent, and theater PR team on all external announcements, press releases, and pitchesIDEAL QUALIFICATIONSAs a Black, female-led organization, CABD is committed to building inclusive teams that reflect the diversity of its work and community. The qualifications denoted below are ideal. Individuals who don’t meet 100% of these ideal qualifications, but have transferable skills or experience, are strongly encouraged to apply.Ability and willingness to lead within a collaborative leadership environment, working in partnership with the DAPP and centering the vision of the Founder & Artistic DirectorDemonstrated commitment to the complexities of the BIPOC experience, working toward inclusion and shaping an equitable and inspiring work environmentExperience in and understanding of the nonprofit dance sector; additional performing arts (nonprofit theater, commercial theater, opera, etc.) experience is highly preferredSignificant nonprofit fundraising experience, from gift strategy to close, across the areas of grants/institutional giving, individual/major giving, and special eventsExperience managing and/or leading Human Resources, with a focus on personnel management and HR equitable practice and policy developmentExecutive management experience with significant external and internal responsibilitiesProven financial acumen at a program/departmental or, ideally, organizational levelClear understanding of Board Governance and Board development strategiesComfort building and cultivating strong, trusting relationships internally and externallyTrack record of developing teams with collaboration and transparency at the helmExperience strategically navigating an organization/department/program through a stage of growth, inflection point, or formal strategic planning process is a plusRelevant educational background or equivalent work experience is required; a degree in a relevant field (e.g., business administration, nonprofit management, etc.) is a plusCOMPENSATION & BENEFITSThe salary range for this position is $95,000 - $105,000, commensurate with experience. Health insurance (medical, dental, and vision) andgenerous PTO are offered, including 4 weeks of vacation, 20.5 paid holidays (inclusive of a week-long organization-wide break), 4 personal days/floating holidays, and 5 sick days. CABD has also intentionally made this role a remote position, with select in-person activities expected, to allow for greater flexibility.APPLICATION INSTRUCTIONSTo be considered, please submit your application electronically as one (1) PDF document tojobs@camilleabrown.orgwith “Executive Director” in the subject line. Applications are requested by or beforeMonday, April 15and will be reviewed in the order received.Applications should include: a resume, a cover letter highlighting your interest and qualifications, and at least three (3) professional references.All applications will be treated as confidential, and references will not be contacted without the candidate’s advance knowledge and agreement. Incomplete submissions will not be considered nor will submissions that are sent via postal mail, fax, or phone."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/paralegal-at-hartree-partners-3854152017?position=25&pageNum=0&refId=dAybijAqwWI0ZNSt6bmGnA%3D%3D&trackingId=kFvpuJY4UMc1k9SHth1y8w%3D%3D&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Paralegal",
            "company_name": "Hartree Partners",
            "location": "New York, NY",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "associate degree"
            },
            "months_of_experience": 60,
            "about": "Company Overview:Energy is always evolving. At Hartree Partners, we use our decades of experience inthe physical and financial energy and commodities markets to explore the opportunities this evolution provides. We assist our customers in participating in new markets and navigating their complexities for maximum revenues at minimum risk.We provide a wide range of services to a substantial and diversified customer base that includes corporations, financial institutions, governments and individuals. Founded in 1997, the firm is headquartered in New York and maintains offices in many financial centers around the world. Hartree Partners LP is owned by the company’s Managing Partners, senior staff, and funds managed by Oaktree Capital.Find out more about us by visiting our website at: http://www.hartreepartners.com/Job Description:The position reports directly to the 2 Senior Legal Counsel and will support US-based Legal Department, which provides legal services to Hartree’s trading and investments teams in support of acquisitions, divestitures, equity investments and joint ventures, as well as support and guidance on a range of other transactions and corporate matters in North America and around the globe.Job Responsibilities:Support our corporate, M&A, Finance and Trading legal functionsPrepare first drafts of basic corporate documents from forms or simple precedent, such as: board resolutions, simple intercompany assignment or contribution agreements, standard side letters, incorporation documents, engagement letters, etc.Draft and revise LOIs, MOUs, PCGsNegotiate ISDAsCoordinate with our London-based Corporate Secretary with respect to U.S.-based corporate governance documents;Review and summarize governance requirements in LLCAs, LPAs and similar constitutional documentsParticipate in legal due diligence of potential acquisition targetsSupport for preparing virtual data rooms in connection with dispositions of assets and/or identifying key documents in virtual data rooms in connection with the acquisition of assetsSupport for records and contracts management, which may include supporting the Legal Department to adopt new processes, procedures and technologies for record keeping functionsDocument review in connection with discovery requests during litigation proceedingsDevelop strong relationships with attorneys in the New York office, with an eye toward identifying potential areas of support for each one’s unique workstreamAssist with other corporate and finance legal matters as neededJob Requirements:Minimum of 5 years experience across a broad range of corporate governance and transactional legal functionsExcellent communication and interpersonal skills, strong judgement, and an eagerness to learnDemonstrates good organizational skills and exhibits aptitude to develop specific and detailed knowledge and understanding of complex issues and proceduresStrong time management skills with ability to multi-task and work in a very fast-paced and team-oriented environmentBasic familiarity with commodity and derivative transactions and related documentation (including ISDA Master Agreement, NAESB, ISDA Commodity Definitions) preferred but not required.Proficient in Microsoft Office*The salary range for this position is $105,000 - $135,000.Employees may be eligible for a discretionary bonus in addition to base pay.This range is an estimate, based on potential employee qualifications, work location, operational needs and other considerations permitted by law."
        }
    }
]