[
    {
        "url": "https://www.linkedin.com/jobs/view/administrative-listing-assistant-at-russ-lyon-sotheby-s-international-realty-3854115341?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=5ybAi28bzrkoc2ZaA7VN9Q%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Administrative & Listing Assistant",
            "company_name": "Russ Lyon Sotheby's International Realty",
            "location": "Scottsdale, AZ",
            "seniority_level": "Entry level",
            "employment_type": "Contract",
            "about": "Job DescriptionFull-time hire in Real Estate Office needed!Thursday-Monday 7:30AM - 4:30PMLooking for someone who is:High energyPositiveBig smileDisciplinedCommittedFocusedPunctualIf inquiring please include answers to the following (do not simply send a Resume):Why do you feel you will be a good fit for this role?What are some of your long term goals?Do you have a reliable vehicle?Thank you,DavidResponsibilities:Listing Management:Coordinate the creation and maintenance of property listings on various platforms.Ensure accurate and up-to-date information, including property details, photos, and virtual tours.Communication:Serve as a liaison between agents, sellers, and other relevant parties to facilitate smooth communication.Respond to inquiries and requests for information from clients and potential buyers.Documentation and Paperwork:Prepare and organize all necessary documents related to property listings, such as contracts, disclosures, and agreements.Ensure compliance with legal and regulatory requirements.Scheduling and Appointments:Manage and schedule appointments for property showings, open houses, and inspections.Coordinate with agents and clients to find suitable time slots.Marketing Support:Assist in the development of marketing materials for property listings, including brochures, online ads, and social media posts.Implement marketing strategies to maximize property exposure.Database Management:Maintain and update databases with accurate and current information on properties, clients, and leads.Utilize customer relationship management (CRM) tools for effective organization.Client Services:Provide excellent customer service to clients by addressing inquiries, resolving issues, and ensuring a positive experience throughout the listing processHandle incoming phone calls & direct as necessaryOversee calendarOversee email + respond to emails as ableInput clients + notes into CRM accordinglyManage / oversee Driven campaignsQualifications:Education and Experience:High school diploma or equivalent is required; additional education in real estate, business administration, or a related field is a plus.Previous experience in real estate administration, coordination, or a similar role is preferred.Real Estate License:Possession of a real estate license is preferred but not required. If the candidate is not licensed, a willingness to obtain a license in the future may be considered.Administrative Skills:Strong organizational and administrative skills, with attention to detail.Proficient in using office software, including word processing, spreadsheets, and email.Communication Skills:Excellent verbal and written communication skills.Ability to effectively communicate with clients, agents, and internal staff.Non-Sales Orientation:Comfort and satisfaction with a non-sales role, focused on administrative and coordination tasks.Understanding and appreciation for the importance of supporting the sales team and facilitating smooth transactions.Customer Service:Strong customer service orientation with the ability to handle inquiries and provide assistance to clients in a professional manner.Team Collaboration:Ability to work collaboratively with a team of real estate professionals, including agents, administrative staff, and management.Tech-Savvy:Familiarity with real estate management software, CRMs, and other tools commonly used in the real estate industry.Market Knowledge:Basic understanding of real estate market trends and terminology."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854113341?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=rfVFwuZ1i7HzTtrd5DUr%2BA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Colorado Springs, CO",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRJcbtWX7zvQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/1st-shift-assistant-operator-%E2%80%93-pick-choose-your-shifts-at-myworkchoice-3854123144?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=EAumfgiYOexr8RQ62HwsQQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "1st Shift Assistant Operator – Pick & Choose Your Shifts",
            "company_name": "MyWorkChoice",
            "location": "Rome, GA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Join MyWorkChoice Where Work-Life Balance isn’t a BuzzwordAre you looking for a job but find it difficult to balance work shifts and your personal life? We have the job for you! As an Assistant Operator hired by MyWorkChoice, you'll get the best of both worlds: the opportunity to work at Mohawk while having control over your work schedule.What You’ll DoAt this Mohawk facility in Rome, GA, you will be a part of a team that meets the production needs by:Assisting operator with production tasksInspect products for quality controlOther duties as assigned by the team lead/supervisorWhat’s in it for You?$16/hr - Paid every FridayWork-life Balance – Choose your shift schedule in the MWC appFinancial Flexibility – Get your money faster before payday through EarnInCareer Advancement OpportunitiesWork Hours*Sunday – Saturday (Pick & Choose Different Shifts)6 AM – 12 PM (6 Hrs)12 PM – 6 PM (6 Hrs)6 AM – 6 PM (12 Hrs)TrainingSchedule your preferred training shift easily through the MyWorkChoice app:8 AM – 12 PM12 PM – 4 PMAvailable Tuesday – FridayLooking to balance a job and your personal life? Apply to be an Assistant Operator with MyWorkChoice today. You’ll get a reliable job and the MWC app makes it easy for you to pick up shifts 24/7.Questions? Give us a call at (866) 824-4898 from 8:00 am to 8:00 pm, Monday through Friday.Working at this Mohawk facility is conditional upon first-day drug screening and meeting background requirements."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854114240?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=PAFsnDYezPBo910gO43rKg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "El Paso, TX",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHR904l5knnjY"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/front-counter-customer-service-rep-at-angelus-block-co-inc-3854120014?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=YA90qYU04pTiVfz7RsIjYg%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Front Counter Customer Service Rep",
            "company_name": "Angelus Block Co., Inc.",
            "location": "Los Angeles, CA",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Job DescriptionInterested Candidates will need to complete an application onsite from Monday through Friday 07:00am to 05:00PM at the following address:11374 Tuxford StreetSun Valley, Ca 91352Angelus Block Company, Inc. is currently seeking to hire a Full-time Customer Service for ourSun Valley, Ca Plant. The Customer Service Representative will assist customers and process orders at inside sales counter and by phone.Description:Looking for an experienced Customer Service Representative in a fast paced environment demanding strong organizational, problem solving, and prioritization skills.Customer Service Representative will provide support to the organization by ensuring that an excellent standard of service and a high level of customer satisfaction is maintained.In addition, the Customer Service Representative will prepare customer service summary reports, and coordinate the handling of difficult and/or unusual situations.Full-time position, from Monday through Friday.Skills/Qualifications:Experience working with building materials is strongly preferred.Detail oriented, resourceful, and thorough in completing projects.Ability to multi-task effectively.Exceptional communication skills, proactive and friendly, conscientious and diligent, committed to contributing to operational goals in a positive, productive way.Proven success at improving customer service, workflow processes and production.Able to work under pressure/deadlines.Ability to communicate effectively in written and verbal forms (e-mail, in-person, telephone).Bilingual (English and Spanish) is preferred but not required.Other duties may be assigned.Experience and/or Education:High school diploma or general education degree (GED) and 4 years related experience and/or training or equivalent combination of education and experience.Possess basic to intermediate math skills.To perform this job successfully, an individual should have knowledge of Microsoft Windows Systems and Microsoft Office Applications.Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.Physical DemandsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit, stand; walk; use hands to finger, handle or feel; and reach with hands and arms. Lifting, pushing, pulling up to 25 lbs.Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.Angelus Block Company, Inc. offers a competitive salary.Angelus Block Company, Inc. is an Equal Opportunity Employer.Company DescriptionFounded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units.Founded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-at-navigate-new-horizons-3854110775?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=XmO1RTMqx%2BVVzdKSwr%2BaSg%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant",
            "company_name": "Navigate New Horizons",
            "location": "Dayton, OH",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Passion for travel draws many to this field, but for success as a Travel Scheduling Assistant, one must embrace not just the allure of travel but also the vast opportunities it offers in connecting histories, cultures, and cuisines. Thriving in this role demands a robust sales acumen, impeccable organizational prowess coupled with a keen eye for detail, adeptness in multitasking within a dynamic environment, proficiency in computer navigation and software applications, as well as effective written and verbal communication skills, all while maintaining a commitment to continuous learning.At our company, we seek individuals who resonate with our values and are eager to push their boundaries both personally and professionally, individuals who are driven by a passion for service and making a meaningful impact on others' lives.Here's an incredible business opportunity to curate dream vacations and craft cruise itineraries with the industry's leading names!Description:Arrange Cruise Travel for vacations, honeymoons, weddings, and more.Determine customer's needs and preferences, such as schedules, costs, and payment plans.Plan and arrange tour packages, excursions, and day trips.Book reservations for travel, hotel, flights, rental cars, special events, and honeymoons.Benefits:Full Training Provided.Flexible Work Hours - Part-Time or Full-Time.No Prior Experience Necessary.Travel Perks Available.Licensed & Bonded.Personalized Website Provided.Access to Daily Training Sessions.Certification Opportunities Offered.Remote Business Opportunity.Requirements:Must be 18+.Computer with good WiFi.Self-Motivated.Detail-Oriented.Customer Service Skills are a plus.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. This is a 1099 Business Opportunity. Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry.Powered by JazzHRPyWyeo79kn"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854115205?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=vqIbX4N9H%2FpOmebgYcAVKw%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Lexington, KY",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRcLYsTUWZia"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854111595?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=SCTLl4QYWDk3dsMZq%2F%2FuTw%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Minnesota, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRvyygM3g5OP"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/guest-relations-specialist-theme-park-remote-at-navigate-new-horizons-3854110768?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=0rqv6zsDz9jtB87suqNOWg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Guest Relations Specialist-Theme Park (Remote)",
            "company_name": "Navigate New Horizons",
            "location": "California, United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Summary: The Guest Relations Specialist plays a vital role in managing reservations and bookings for theme parks, ensuring guests have a seamless and enjoyable experience from start to finish. Below are the main duties and qualifications for this position:Main Responsibilities:Booking Management: Oversee the booking process for individuals, families, and groups to ensure efficiency. Assist guests in choosing suitable ticket packages and accommodations based on their preferences. Monitor and optimize reservation systems to maximize park capacity.Guest Interaction: Deliver outstanding customer service by addressing inquiries, fulfilling special requests, and resolving booking-related issues promptly. Educate guests about park policies, pricing, and ongoing promotions. Foster a welcoming and hospitable environment for all park visitors.Record-Keeping: Maintain precise records of reservations, ticket sales, and guest details. Generate reports to analyze booking patterns and support data-driven decision-making. Ensure online booking platforms remain current and user-friendly.Revenue Maximization: Identify opportunities for upselling, such as meal plans, fast passes, or premium experiences. Collaborate with marketing and sales teams to devise strategies for boosting bookings and revenue.Issue Resolution: Effectively handle booking-related concerns, including modifications, cancellations, and refunds. Address guest complaints and escalate complex issues as necessary.Compliance and Safety: Ensure adherence to health and safety regulations, particularly in challenging circumstances like pandemics. Stay abreast of park policies and procedures, and communicate them clearly to guests.Qualifications:High school diploma or equivalent; while a degree in hospitality or business is advantageous, it's not mandatory. Previous experience in customer service, preferably within hospitality, travel, or entertainment sectors, is a bonus but not obligatory. Excellent communication and interpersonal skills. Strong attention to detail and organizational prowess. Ability to thrive in a dynamic, fast-paced setting. Knowledge of theme park attractions is beneficial but not essential.As a Theme Park Specialist, you'll play a crucial role in shaping guests' experiences, ensuring their satisfaction, and contributing to the park's overall success. Your adeptness in managing reservations, delivering exceptional customer service, and assisting guests in maximizing their visit will be pivotal in upholding the park's reputation and driving its prosperity.Benefits:Flexible Schedule Travel Perks Commission-based Licensed & Bonded Personal Website E&O Insurance with Fraud Protection Daily Training Available Travel Agent Certification Remote Business Opportunity 1009 Commission Full Training Provided Work FT or PT No experience necessaryRequirements:A dedicated home workspace, including: Computer Cell phone High-speed internet Minimal distractions Must be 18+ Must be authorized to work in the USA, Australia, MexicoPowered by JazzHRWOh4KOwwjX"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/hotel-reservationist-remote-at-navigate-new-horizons-3854111658?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=fBGNabECoh8TK6x5Cy9ktg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Hotel Reservationist-Remote",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "We are actively searching for an individual with meticulous attention to detail and a customer-centric mindset to join our team as a Remote Hotel Reservationist. If you possess outstanding communication skills, radiate warmth, and harbor a genuine passion for hospitality, we extend a warm invitation for you to become part of our team today! Comprehensive training will be provided.Responsibilities:Manage hotel reservations, handling inquiries, making bookings, and confirming room availability.Interact with guests through phone, email, and in-person, addressing reservation inquiries, changes, and cancellations.Assist guests during check-in and check-out, ensuring a seamless process and attending to special requests or concerns.Collect payment information, process reservations, and issue invoices or receipts as necessary.This remote position offers the flexibility to work from the comfort of your home or any location with an internet connection. We value the importance of work-life balance, enabling you to manage your workload in alignment with your lifestyle.As a Remote Hotel Reservationist, you have the opportunity to take control of your financial future. This isn't just a job; it's a chance to establish your own business within our framework. Determine your income potential, and we'll provide the support and resources to help you succeed, transforming your passion into a flourishing career.Benefits:Remote position with a flexible work environment.Competitive salary.Travel perks and discounts for personal and professional travel.Free training.Familiarization (FAM) Trips.Supportive team.Qualifications:Excellent communication and interpersonal skills with a courteous and welcoming demeanor.Organizational and multitasking abilities.Attention to detail and accuracy.Ability to work independently and collaboratively as part of a team.Strong knowledge of travel destinations, attractions, and various travel products and services.Exceptional customer service and problem-solving abilities.Passion for travel and a desire to help others create memorable experiences.Must be 18 years or older.This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRt6RtAN6DDc"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854110764?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=DefS3K0ZFZhJZjBbybjiwQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Are you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryThis opportunity is available for candidates within the USA, Mexico and Australia and United KingdomPowered by JazzHRrQqNzTr0HK"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/full-time-machine-operator-m-f-%E2%80%93-3pm-%E2%80%93-1-30am-at-myworkchoice-3854120152?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=TWFGqTHs76yALUlafIvPdQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Full-Time Machine Operator (M-F – 3pm – 1:30am)",
            "company_name": "MyWorkChoice",
            "location": "Shelbyville, KY",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "high school"
            },
            "about": "Are you looking for a dependable, full-time job with the opportunity to grow? We have the job for you!As a Machine Operator hired by MyWorkChoice for Stanley Black & Decker, you’ll receive consistent full-time hours with a set weekly schedule. Apply, complete your paperwork, and get hired—all within the MyWorkChoice App.What You’ll DoAt this Stanley Black & Decker facility in Shelbyville, KY, you will be a part of a team that meets the production needs by:Operating machines and replenishing materialsInspect products for quality defectsAssist with adjustments to machines & equipmentWhat’s in it for You?Digital Hiring Process - Apply, complete paperwork, and get hired directly from your phone using the MyWorkChoice app.Full-time Hours with Temporary Mandatory Overtime - Stable income and job securitySchedule at Your Fingertips – See shift updates or overtime opportunities in the app 24/7.$17.50/hr - Paid every FridayEarn up to $840/week with overtimeGet your money faster before pay day with EarnInCareer Advancement OpportunitiesWork ScheduleRegular Hours:Monday – Friday3 pm – 11:30 pmDuring Mandatory Overtime PeriodMonday – Friday3 pm – 1:30 am (10-hour shifts)Occasional overtime opportunities for an 8-hour shift may be available on Saturdays.Get Started With MyWorkChoiceClick the 'Apply Now' buttonConfirm your email address for application updatesDownload the MyWorkChoice app to complete your application, paperwork, and get hired.Apply now from anywhere using the MyWorkChoice app, manage your schedule easily, and instantly view shift updates and overtime opportunities—all from your phone.Questions? Give us a call at (866) 824-4898 from 8:00 am to 8:00 pm, Monday through Friday.Working at this Stanley Black & Decker facility is conditional upon meeting background requirements and passing a pre-employment drug screen."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/marketing-consultant-at-swell-partners-3854131156?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=Pf79blfuWCmyGXyTKWY5Yg%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Marketing Consultant",
            "company_name": "Swell Partners",
            "location": "New York, United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Contract",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "Our client, a healthcare technology company, is looking to hire a Marketing Consultant, who will join the Strategic Client and Segment Growth Marketing team, concentrating on implementing engagement strategies to boost consumer adoption and generate revenue growth. This pivotal role requires strategic insight coupled with operational prowess, collaborating extensively with cross-functional teams and clients to bolster member engagement and deepen client relationships. The ideal candidate will possess a robust B2B2C marketing background, exemplary client management capabilities, and a fervent interest in advancing healthcare innovation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/human-resources-administrator-at-discover-the-world-global-3854120203?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=73vanONdmLvmX7rsiLdExg%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Human Resources Administrator",
            "company_name": "Discover the World - Global",
            "location": "United States",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "about": "Global HR AdministratorWe are looking for a motivated and enthusiastic Global HR Administrator to join our team!Our people are our greatest asset, and you will lead by delivering a positive experience for our teams, offering friendly customer service along with a sense of urgency.You will serve as the main point of contact companywide, supporting both employees and department heads in HR related duties ranging from onboarding to answering enquiries such as payroll questions, benefits, employee records, and time tracking. You are skilled at handling employee information with the sensitivity and confidentiality it deserves.You will have experience in multi-country payrolls, with working experience in the USA and United Kingdom, being the most essential. You will work with our payroll vendors and help us streamline processes and improve our ability to centralize global payroll activities and reporting.Responsibilities:Participate and coordinate employee onboarding. You will ensure a smooth process of new hires from creating new employee records, explaining, and setting up employee benefits, reviewing company policies, and gathering payroll information such as withholding, and getting signatures on documents.Lead and coordinate collection of all employee documents and records across multiple countries. ensuring accurate employee records by recording hiring, transfers, terminations, change in job classifications, merit/bonus dates, and tracking time off such as vacations and sick time.Oversee and protect confidential information such as employee records, compensation, issues, and any sensitive information.Secure and review benefits annually such as healthcare and retirement/pension providersManage end-to-end payroll processes for multiple countries (starting with the USA & UK) including data collection, calculations, and disbursements, to ensure accurate and timely payments.Work closely with accounting teams to make sure payroll is accurately funded each month.Provide payroll and employee reports to leadership team.Collaborate with payroll service providers and vendors, ensuring service levels meet established standards. Manage relationships to optimize payroll processes and resolve any issues.Identify opportunities for streamlining payroll processes and payroll reports, and vendors.QualificationsExperience in handling employee onboarding, record keeping and benefit analysis.A minimum of 2 years of multi – country payroll experience. Experience with ADP and knowledge of ADP global payroll capabilities preferred.Ability to work independently and ensure all payrolls are done on time and accurately.Excellent people skills (written and verbal).Ability to balance multiple projects simultaneously, is flexible, enjoys collaborating with other teams and is deadline driven.Proficiency with data analysis, - Microsoft Excel & knowledge of Microsoft Office,Certifications in CPP or FPC payroll are a plus, but not required."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-research-scheduling-assistant-entry-level-at-navigate-new-horizons-3854112372?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=w75jRoJEaEkDTdnbuBfA4Q%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Research & Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Tacoma, WA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRPQxB4cJH7W"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/remote-mental-health-counselor-lcsw-lmft-lpc-or-lp-required-at-sondermind-3854120030?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=DXXVSw7xMtLw5aT5irg1%2Fw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Remote Mental Health Counselor (LCSW, LMFT,  LPC, or LP REQUIRED)",
            "company_name": "SonderMind",
            "location": "Aurora, CO",
            "seniority_level": "Mid-Senior level",
            "employment_type": "Full-time",
            "education_requirements": {
                "@type": "EducationalOccupationalCredential",
                "credentialCategory": "bachelor degree"
            },
            "about": "SonderMind is a leading mental health care platform that is revolutionizing therapy services. We seek compassionate and highly skilled licensed mental health therapists to join our expanding network.As a SonderMind therapist, you will have the opportunity to make a meaningful impact on the lives of individuals seeking therapy while enjoying the flexibility and support of our innovative platform.Our therapists are committed to delivering best-in-class care to all individuals by focusing on high-quality clinical outcomes – and finding new ways to use data to help people get better.At SonderMind, we enable clinicians to thrive.ResponsibilitiesProvide exceptional, evidence-based therapy services to a diverse clienteleConduct thorough assessments and create personalized treatment plansDeliver therapy sessions using various modalities, including individual, couples, and family therapyCollaborate with clients to set goals and monitor progress throughout treatmentMaintain accurate and up-to-date clinical documentation following regulatory guidelines.Utilize SonderMind's user-friendly platform for efficient client scheduling and session notes managementBenefits Of Joining SonderMindFlexibility: Enjoy the freedom to set your own working hours and maintain a healthy work-life balanceClinical Autonomy: SonderMind values your clinical expertise and empowers you to make informed decisions about treatment approachesSupportive Community: Access a network of like-minded therapists, dedicated support from our platform, and ongoing opportunities for collaboration and growthFree and stress-free credentialing with major insurers: We have streamlined the credentialing process and handle all the hard stuff for you so that you can expand your practice by accepting insurance from major payors in your state in weeks, not monthsGuaranteed Pay: We handle all the billing for you and guarantee pay bi-weekly for completed sessions-including no-showsThoughtful client matching and dedicated coaches to grow your practice: We help you get paired with individuals who are ideal clinical matches so that you can control and personalize your caseload, and a dedicated coach to help you help your clients, no matter what your specialty, from pediatric mental health to trauma, anxiety or addiction, we help you help othersProfessional Development: SonderMind is committed to helping therapists grow professionally, offering ongoing training and resources to enhance skillsAbsolutely no fees or membership charges: We don’t charge you to deliver care, and all of the features, access, tools, and resources you get come free of chargeReferral BonusSonderMind values the contributions of our therapists and encourages you to refer qualified colleagues to join our network. For each qualified therapist you refer to SonderMind, who completes the onboarding process and begins serving clients, you will receive a referral bonus of $500.RequirementsMaster's degree or higher in counseling, psychology, social work, or a related field.Must be fully licensed by the State Board to provide therapy independently and without supervision (e.g., LPC, LCSW, LMFT, or LP)."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/litigation-paralegal-insurance-defense-at-roberts-markel-weinberg-butler-hailey-pc-3854122137?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=eKgQfw4g7M1m%2BfSyPsfBKA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Litigation Paralegal - Insurance Defense",
            "company_name": "Roberts Markel Weinberg Butler Hailey PC",
            "location": "Austin, TX",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionWe have a great opportunity for a Paralegal with 3-5 years of Insurance Defense Litigation experience in our Bee Cave location.Qualified candidates must have a minimum of three years of full time experience as a billable paralegal or legal assistant. Candidates must be self-motivated, committed to excellence in the workplace, and have excellent attention to detail. Candidates must also have demonstrated ability to prioritize and balance competing demands and meet deadlines in a fast-paced professional environment. Excellent writing skills are required, and candidates must be proficient in the use of PowerPoint, Word, Excel, and database applications. Trial experience is preferred.KNOWLEDGE, SKILLS, AND ABILITIES:Summarizing cases and preparing reports for attorneysConducting research, investigating facts and developing legal argumentsDrafting legal documents such as contracts, depositions and pleadingsPreparing and filing documents with courtsCalendaring/scheduling for multiple attorneysStrong ability to multi-task; high level of time-management skills.Attentive to details with good follow through and follow up, possess the ability to anticipate what needs to be done.Superior verbal and written communication skills; excellent proofreading skills.Ability to effectively interact and communicate with others, both externally and internally all organizational levels and locations.Strong knowledge of MS Office applications, including Word, Excel, PowerPoint, and Outlook. Ability to learn and effectively utilize various computer applications and other forms of technology.Ability to maintain a customer/client focus and build rapport with others inside and outside the firm.High level of professionalism; maintain confidential information.Proven ability to take initiative in order to meet client/customer needs.Work independently with minimal supervision.Ability to adapt to changing priorities and remain calm in high pressure situations.TRAINING AND EXPERIENCE:Minimum High School Diploma or equivalent.Bachelor’s Degree or Paralegal Certificate a plus.Proficiency with e-filing.A minimum of three years experience in a similar position.May be required to act as a Notary Public.Benefits:Some of our most popular additional benefits at our Firm include: flexible working environment, remote working, paid lunches, paid parking, and a wellness program which includes Corporate sponsored Lifetime Fitness memberships or gym reimbursements.Compensation is based on experience. Bonus eligible. Firm benefits include 401(k), medical, dental, vision, supplemental policies, long term care, identity theft and legal services, life insurance, and pet insurance. The firm offers parental leave.Roberts Markel Weinberg Butler Hailey PC is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.Company DescriptionRoberts Markel Weinberg Butler Hailey PC has provided the experience and service our clients require for their transactional and litigation needs for more than 40 plus years. Our practice areas include community associations, labor and employment for business owners and employers, professional liability, directors and officers litigation, fiduciary litigation, commercial litigation, elder law, appeals, construction law, corporate matters and real estate transactions.Roberts Markel Weinberg Butler Hailey PC has provided the experience and service our clients require for their transactional and litigation needs for more than 40 plus years. Our practice areas include community associations, labor and employment for business owners and employers, professional liability, directors and officers litigation, fiduciary litigation, commercial litigation, elder law, appeals, construction law, corporate matters and real estate transactions."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/medical-receptionist-at-medmasa-3854124834?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=VRn%2BCJqSd3XrNISxomINHg%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Medical Receptionist",
            "company_name": "MedMasa",
            "location": "Jacksonville, FL",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionMedical Receptionist/ Jacksonville, FL USAPay rate: 14/hrShitfs: 08:00 am to 05:00 pmJob DescriptionWe are seeking a highly motivated and organized individual to join our team as a receptionist. This is a crucial role in our organization, as you will be the first point of contact for visitors, phone calls, and emails. You will play a key role in creating a positive first impression and ensuring the smooth operation of our office.Responsibilities:Greet visitors warmly and professionally, ascertain their needs, and direct them to the appropriate person or department.Answer and screen phone calls politely and efficiently, transferring calls as necessary.Process incoming and outgoing mail and packages.Schedule appointments and meetings using a scheduling software.Maintain an organized and presentable reception area.Prepare documents and presentations as needed.Assist with administrative tasks such as data entry and filing.Order office supplies and equipment.Perform other duties as assigned.Qualifications:High school diploma or equivalent required.Minimum of 1 year of experience in a receptionist or administrative role preferred.Excellent communication, interpersonal, and organizational skills.Proficient in Microsoft Office Suite.Ability to multitask and prioritize effectively.Positive and professional demeanor.Detail-oriented and accurate.Ability to work independently and as part of a team."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/homemaker-at-pennybyrn-3854114966?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=NLogpjDAIxhBuwbI6%2Fr0cw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Homemaker",
            "company_name": "Pennybyrn",
            "location": "High Point, NC",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "Job DescriptionPennybyrn has an opportunity for a Homemaker to join our innovative, inclusive, and compassionate life-enriching community! For more than 70 years, Pennybyrn has been a leader in providing compassionate service and care to older adults. Our non-profit organization embraces a faith-based mission to \"Demonstrate God’s Love for the Lives we touch\", and we are committed to honoring our core values of:Faith in ActionSupport an empowered, compassionate communityNurture the human spirit and appreciate the individualAccountabilityExcellence in ServiceContinuous Education and GrowthResponsibilities of this position:We are hiring for Part Time & Full Time. Shifts available are part-time with hours ranging from 6:00 am - 2:00 pm, or 10:00 am - 6:00 pm, including weekends. The Homemaker performs the combined duties of dining services and housekeeping. As cook, the homemaker will prepare food for household meals and snacks that are healthy and appetizing and served in a timely manner, maintaining high quality standards and portion control using standardized recipes. The Homemaker assumes general responsibility for the kitchen in the absence of the Dietary Manager. Assists with serving resident meals, snacks and nourishment. Plans and facilitates activities for elders and the household that involve food preparation or other activities specific to the kitchen. Performs housekeeping duties to maintain cleanliness and neatness of resident bedrooms, living areas, restrooms and kitchen, including sweeping, mopping, dusting, etc.Why work with us?Pennybyrn is a resident-centered retirement community with a team-driven culture that is truly engaging and unique! Located in High Point, NC, our community consists of Independent Living, Assisted Living, Healthcare Households, Transitional Rehab, Memory Support, and coming soon, Adult Day Care. Candidates who enjoy working with older adults and strive to inspire extraordinary living in others will love becoming a part of our team!What sets us apart?We strive to create and maintain an outstanding work environment that includes a rich benefit package:PTO (Paid Time off) eligibility for all employeesExcellent low-cost and no-cost insuranceRetirement Plan (401k) with Employer MatchingAdvancement of earned daily wagesEmployee Assistance and Education opportunitiesNC Apprenticeship Nursing programFree Fitness Center and Wellness programsDelicious, high quality, freshly made meals in a variety of venuesDiscounted services for Barber/Beauty shop and Massage TherapyBeautiful, mature campus with walking trailsFaith-based and mission-driven since 1947, with a rich and vibrant Irish heritageA true, team spirit and belief in making a difference togetherEnthusiastic and sincere appreciation for every person every day!Company DescriptionPennybyrn is a unique community that offers innovative choices in senior living. In our seven decades of caring, we’ve earned a reputation for compassion, excellence, and quality that truly sets us apart.Non-Profit, Faith-Based Mission and ValuesYou’ll find a loving, warm, and respectful way of life that honors the dignity of each person in the Pennybyrn community. Dedication to these faith-based values translates to a high standard of service and care delivered with utmost compassion. Founded in 1947 by the Poor Servants of the Mother of God, a Catholic order, we continue to serve all faiths with love.Welcoming CommunityOur smaller population means those in our care receive personalized service and attention. Our inclusiveness means resident's voices are always heard. There's a natural camaraderie at Pennybyrn among staff and residents and who soon know each other well and feel as close as family.Natural Beauty and Relaxed EnvironmentThe beauty of our 71-acre community balances expert landscaping with stunning natural views. This peaceful setting helps relax, inspire, and lift the spirits.A Leader in Innovative Senior Living and Life-Enriching ServicesFrom delicious dining options and a wide array of fitness opportunities, to special speakers and clubs, Pennybyrn designs programs and activities with high resident involvement. Pennybyrn is the only community in North Carolina to implement a comprehensive and complete household care model for assisted living, memory care, skilled nursing, and transitional rehabilitation.Pennybyrn is a unique community that offers innovative choices in senior living. In our seven decades of caring, we’ve earned a reputation for compassion, excellence, and quality that truly sets us apart. Non-Profit, Faith-Based Mission and Values You’ll find a loving, warm, and respectful way of life that honors the dignity of each person in the Pennybyrn community. Dedication to these faith-based values translates to a high standard of service and care delivered with utmost compassion. Founded in 1947 by the Poor Servants of the Mother of God, a Catholic order, we continue to serve all faiths with love. Welcoming Community Our smaller population means those in our care receive personalized service and attention. Our inclusiveness means resident's voices are always heard. There's a natural camaraderie at Pennybyrn among staff and residents and who soon know each other well and feel as close as family. Natural Beauty and Relaxed Environment The beauty of our 71-acre community balances expert landscaping with stunning natural views. This peaceful setting helps relax, inspire, and lift the spirits. A Leader in Innovative Senior Living and Life-Enriching Services From delicious dining options and a wide array of fitness opportunities, to special speakers and clubs, Pennybyrn designs programs and activities with high resident involvement. Pennybyrn is the only community in North Carolina to implement a comprehensive and complete household care model for assisted living, memory care, skilled nursing, and transitional rehabilitation."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/receptionist-at-cor-pro-systems-operating-ltd-3854118055?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=TSH7t8uM0oyJGOvkKly5Uw%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Receptionist",
            "company_name": "Cor-Pro Systems, Operating Ltd.",
            "location": "Houston, TX",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionPURPOSE OF POSITION:As the first point of contact, the Receptionist is the face and voice of the company and has the responsibility to provide outstanding customer service. This entails creating an overall welcoming environment, having a smiling/pleasant personality, and a friendly voice over the phone. The goal is to make guests and visitors feel comfortable and valued.Create and maintain a welcoming and organized atmosphere. (Feeling of trust & appreciation)To act and behave in alignment with the Company Spirit (Mission, Philosophy and Values)DUTIES, ROLES, RESPONSIBILITIES AND FUNCTIONS:Spanish-English Translation when needed (in person and on paper) - A must for the position!Answers telephones and directs the caller to the appropriate employee. Transfers a caller to an employee’s voice mailbox when the associate is unavailable.Produces and distributes employee contact list once a month and/or on a by need basis.Greets and directs visitors to the company. Makes sure all visitors sign in and out.Assures that guests and inspectors wear appropriate safety gear before entering the shop.Takes and retrieves messages for various personnel.Provides callers with information pertaining to company address, directions, fax numbers, company website and other related information.Receives, sorts and forwards incoming mail. Maintains and routes publications.Ensures lobby and receptionist desk are kept organizedRefrains from eating while at the front deskOperates main office equipment if required. Communicates with vendor if maintenance is needed.Offering Administrative support across the organization.Oversees the reservation of the company’s training and meeting rooms. Keeps a well-organized calendar for booking meetings and trainings and resolves any conflicting scheduling issues.Assists in the ordering, receiving, stocking and distribution of office and coffee bar supplies.Ensures coffee is made fresh each morning and throughout the day as well as replenishing the cookies/candies for visitorsAssists with other related clerical duties such as photocopying, faxing, filing and collating.Supports the HR/QC department with various clerical duties.Coordinates the pick-up and delivery of express mail services for the HR department.Keeps applications, painter and blaster tests available at all times for future applicantsDuties, responsibilities and activities may change at any time with or without notice. Other related duties may be required and assigned.Skills, Knowledge, Ability: Must be proficient in Microsoft Office. Must be a quick learner to use in house computer software as it pertains to the position. Must have strong Time Management skills to be able to handle multiple tasks at once balancing priorities (Working with the team, customers and management, etc.).Language requirements include the ability to communicate in English, both verbally and in writing well enough to relate and understand technical and business information. Bilingual fluency in English and Spanish is an asset preferred in our culturally diverse market.QUALIFICATION/ EDUCATION REQUIREMENTS:A High School Diploma or equivalent, One to two years of related experience preferredTRAINING REQUIREMENTS(frequency):Refer to Training Matrix. Frequency determined per Annual Performance Review.All training (job orientation, health and safety issues) is conducted in English.STRENGTH(Sedentary Work):Physical: Able to walk, stand, sit, stretch, climb, bend and climb stairs. Must be able to flex arms, wrists, hands, fingers, reach and grasp.Involves sitting majority of the day, but may involve walking or standing for periods of 5 minutes or greater."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/virtual-scheduling-assistant-entry-level-at-navigate-new-horizons-3854108853?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=aJqzrYqgB7vUGoOtBDwLGw%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Virtual Scheduling Assistant-Entry Level",
            "company_name": "Navigate New Horizons",
            "location": "Fort Wayne, IN",
            "seniority_level": "Entry level",
            "employment_type": "Part-time",
            "about": "A love of travel attracts many people to the field, but to succeed, a Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!️Job Description:Arrange Cruise Travel for vacations, honeymoons, weddings and moreDetermine customer's needs and preferences, such as schedules, costs and payment plansPlan and arrange tour packages, excursions, and day tripsBook reservations for travel, hotel, flights, rental cars, special events, honeymoonsBenefits:Full Training ProvidedWork PT or FTNo experience necessaryTravel PerksLicensed & BondedPersonal WebsiteDaily Training AvailableCertification providedRemote Business Opportunity️Requirements:Must be 18+Computer with good WiFiSelf MotivatedDetail OrientedCustomer Service Skills is a plusThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel IndustryPowered by JazzHRZwM5CF6W5N"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/chief-business-officer-at-the-crox-group-3854162687?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=vCbcXxfutDxtpk02OB7gyQ%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Chief Business Officer",
            "company_name": "The Crox Group",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "Role: Chief Business Officer/ Chief Growth OfficerLocation: Green Bay, WI (Remote)Job Type: Full Time PositionJob SummaryReporting to the CEO, this position will partner with the executive team and business unit leaders, as well as interact with members of the Board, to develop and drive organic and acquisition growth strategies and initiatives within the corporation and its affiliated companies, resulting in the achievement of our profitable growth and client stability goals. This position will be based out of the Green Bay, Wisconsin location with professional flexibility.Primary ResponsibilitiesActively participate in strategic planning and forecasting process to align the organization’s business strategies and long-term initiatives with profitable growth and client stability goalsPartner with CEO and business unit leaders to determine effective sales organization design, engage in selection of new team members (market leaders, client leaders, business development leaders) and related third-party resources, and maintain dotted-line relationship with sales and marketing team members across all companiesChampion the development, implementation, and effective application of sales and marketing practices and standard work processes/tools across all companies (e.g., brand/marketing standards, sales/marketing planning, sales process, proposal standards, presentation standards)Research/identify new markets, services, and delivery method opportunities in coordination with business unitsIdentify/leverage cross-selling opportunities between business unitsSponsor training and development initiatives supporting the development of the sales organization, including sales process, client negotiations, project pricing, portfolio management, and risk managementIn support of business unit client relationship activities, effectively engage with key clients, to include reviews of proposals and presentations, attending selected conferences, and participating in client partnership meetingsTravel to client sites and/or other local offices as neededAct as a role model to fellow members by demonstrating behaviours consistent with our brandRequired QualificationsBachelor’s degree in business, engineering, or related technical field15+ years of experience driving strategic growth in P&L leadership capacity for a mid-sized or larger company or significant business unit, including leadership of high-growth sales teams/functions.Preferred QualificationsEngineering degree and/or professional engineering license.Master of Business Administration.Knowledge of the markets in which company does business.Previous responsibility for marketing functions.Experience in a professional services/consulting environment.Mergers & Acquisitions (M&A) experience."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/home-based-reservation-agent-at-navigate-new-horizons-3854109807?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=0QMyJHiJtETW%2FjZ%2FMnmTig%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Home-Based Reservation Agent",
            "company_name": "Navigate New Horizons",
            "location": "United States",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Position: Home-Based Reservation Agent - Thriving Business Opportunity in the Travel IndustryAre you passionate about travel and customer service? Seize the chance to embark on an exciting journey as a Home-Based Reservation Agent in the travel industry with our thriving host agency.Key Responsibilities:As a Reservation Agent, you'll be the linchpin connecting travelers to their dream destinations. Your responsibilities will include:Booking Expertise: Utilize your passion for travel to assist clients in booking flights, accommodations, and other travel-related services.Customer Service Excellence: Provide exceptional customer service throughout the reservation process, addressing inquiries, concerns, and ensuring a seamless travel experience.Collaboration with Host Agency: Work closely with our established host agency, leveraging their resources, support, and industry expertise to enhance your success.Stay Informed: Stay up-to-date with industry trends, travel regulations, and destination information to provide clients with accurate and relevant recommendations.Flexible Work Environment: Enjoy the flexibility of working from the comfort of your own home, allowing you to balance your work and personal life.Business Growth: This isn't just a job; it's an opportunity to build your own travel business within our organization. Your dedication and hard work can shape your financial future and open doors to career advancement.Qualifications:Excellent communication skillsPassion for travel and helping othersStrong problem-solving abilitiesComputer literacyDesire to work from homeBenefits:Competitive commission structureComprehensive training and ongoing supportFlexibility in work hoursAccess to exclusive travel perks and discountsThis entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business OpportunityJoin our team now to unlock your freedom and start your Entrepreneurial Journey in the Travel IndustryNote: This opportunity is available for candidates within the USA, Mexico and AustraliaPowered by JazzHRe8s4AC5jHQ"
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/executive-director-at-camille-a-brown-dancers-cabd-inc-3854120852?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=QPScIKwFeb8AibHBIOMxiQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Executive Director",
            "company_name": "Camille A. Brown & Dancers (CABD, INC.)",
            "location": "United States",
            "seniority_level": "Executive",
            "employment_type": "Full-time",
            "about": "BACKGROUNDFounded by prolific choreographer and Artistic Director Camille A. Brown, and incorporated as a nonprofit in 2017, Camille A. Brown & Dancers (CABD) is a Bessie award-winning, NYC-based performing arts organization. Committed to implementing and advancing Camille A. Brown’s artistic vision, CABD creates and presents performances, offers dance engagement activities through its Every Body Move program, and investigates historical and contemporary cultural, personal, and social justice issues through the art of dance theater and other performing art mediums. Its mission is to provide a multi-faceted platform for sharing and building an understanding of and appreciation for the African American experience by fostering interaction and dialogue among diverse communities within its NYC hometown, across the country, and globally.POSITION SUMMARYThe Executive Director (ED) is a vital member of CABD’s three-member Executive Leadership Team, which is led by the Founder & Artistic Director (AD) and includes the Director of Artistic Planning & Producing (DAPP). The ED oversees administrative departments and day-to-day administrative operations, including Finance, Operations, Human Resources, Development, Communications, and Board Governance. The DAPP oversees artistic departments and day-to-day artistic operations, serving as the AD’s proxy in this regard. The ED and DAPP partner closely and regularly connect with the AD to advance the organization in an aligned manner.The ED is responsible for the administrative leadership and skillful management of CABD with a focus on organizational culture, team management, fundraising, and oversight of the operating budget (currently $1.8M). This position calls for a highly collaborative, organized, and motivated leader who is excited to co-develop and implement a holistic vision for CABD’s future, given the organization’s recent, notable growth and the opportunity created by the breadth of Camille A. Brown’s artistic projects outside of the nonprofit dance world. The ED will be encouraged to build upon CABD’s existing foundation, with the freedom to evolve systems, practices, and priorities in partnership with the staff. It’s also anticipated that CABD will engage in a strategic planning process in the near future, which the ED will help spearhead.RESPONSIBILITIESStrategic LeadershipCollaborates with the Executive Leadership Team (AD, ED, DAPP) and Board of Directors to identify and achieve organizational goalsIn partnership with the DAPP, centers and advocates for the AD’s vision across organizational decision-making, priorities, and practices—both internally and externallyServes as the administrative leader on the Executive Leadership Team, with final say and oversight of matters related to the operating budgetand all administrative departments and activitiesIn partnership with the Board Chair, manages Board relations, meetings, and giving, further advancing Board development, recruitment, onboarding, and active participationEngages in weekly meetings with the DAPP and regular meetings with the Executive Leadership Team (including the AD) to uphold communication and aligned leadershipHelps spearhead an upcoming, anticipated strategic planning process in partnership with the Board, Executive Leadership Team, staff, and an external ConsultantOrganizational Culture & Human Resources LeadershipProvides strong, effective, positive, and empathetic leadership for CABD staffPromotes a healthy organizational culture where cross-functional collaboration, transparency, and staff contributions are valuedModels high standards of performance, teamwork, and collegiality, and holds staff responsible for maintaining these standardsSupervises all budget-related decisions, including those posed by the AD and DAPPSupervises and, as needed, recruits an administrative team appropriate for the needs of the organization; currently this team includes three (3) full-time staff (Director of Finance & Operations, Director of Community Engagement & Education, & Development Officer) and three (3) part-time staff (Social Media Coordinator, Community Engagement Program Associate, & Administrative Associate)Supports staff in their careers, ensuring that they are provided with regular feedback, opportunities for professional development, and clarity on professional growth at CABDOversees and implements HR activities including approving payroll, coordinating employee benefits, issuing employee contracts, and developing policies and proceduresBuilds upon, formalizes, and streamlines personnel management and HR practicesSupports the DAPP in the negotiation and development of artistic contracts, as neededFinancial & Operational LeadershipFiscally manages the organization, developing and leading the annual operating budget and overseeing the annual audit, organizational investments, and cash reservesPartners with the Board Finance Committee, and full Board, on organizational financial oversight and monitoring, providing timely updates, reports, and recommendationsIdentifies earned/contributed revenue opportunities and engages staff to advance themCodifies operational policies and procedures, evaluating and improving them with the goal of increasing clarity, efficiency, and equityOversees the Community Engagement & Education Program (Every Body Move), advising and facilitating activities as the department needsSupports the AD and DAPP with various artistic projects and programs, as neededDevelopment & Communications LeadershipLeads the efforts to generate contributed revenue (currently ~$1.3M) by developing, overseeing, and supporting the implementation of the annual fundraising strategyServes as the organization’s frontline fundraiser and organizational relationship-builder, soliciting gifts, developing grants, cultivating relationships, and identifying opportunitiesEdits and approves grant proposals, budgets, and reports and, at times, develops these materials independentlyCreates and implements an individual giving and major gifts program above and beyond the annual appealActivates, guides, and prepares the Board as ‘friendraisers’ and fundraisersPartners with the DAPP and staff on cultivation/special event strategy and oversightSupervises grant compliance, supporter recognition, gift documentation and acknowledgement, prospect research, and supporter stewardshipDevelops copy for programs, e-newsletters, appeals, invitations, ads, brochures, and other marketing collateral, as needed, and/or edits and approves staff-developed copyPartners with the Executive Leadership Team, CABD press agent, and theater PR team on all external announcements, press releases, and pitchesIDEAL QUALIFICATIONSAs a Black, female-led organization, CABD is committed to building inclusive teams that reflect the diversity of its work and community. The qualifications denoted below are ideal. Individuals who don’t meet 100% of these ideal qualifications, but have transferable skills or experience, are strongly encouraged to apply.Ability and willingness to lead within a collaborative leadership environment, working in partnership with the DAPP and centering the vision of the Founder & Artistic DirectorDemonstrated commitment to the complexities of the BIPOC experience, working toward inclusion and shaping an equitable and inspiring work environmentExperience in and understanding of the nonprofit dance sector; additional performing arts (nonprofit theater, commercial theater, opera, etc.) experience is highly preferredSignificant nonprofit fundraising experience, from gift strategy to close, across the areas of grants/institutional giving, individual/major giving, and special eventsExperience managing and/or leading Human Resources, with a focus on personnel management and HR equitable practice and policy developmentExecutive management experience with significant external and internal responsibilitiesProven financial acumen at a program/departmental or, ideally, organizational levelClear understanding of Board Governance and Board development strategiesComfort building and cultivating strong, trusting relationships internally and externallyTrack record of developing teams with collaboration and transparency at the helmExperience strategically navigating an organization/department/program through a stage of growth, inflection point, or formal strategic planning process is a plusRelevant educational background or equivalent work experience is required; a degree in a relevant field (e.g., business administration, nonprofit management, etc.) is a plusCOMPENSATION & BENEFITSThe salary range for this position is $95,000 - $105,000, commensurate with experience. Health insurance (medical, dental, and vision) andgenerous PTO are offered, including 4 weeks of vacation, 20.5 paid holidays (inclusive of a week-long organization-wide break), 4 personal days/floating holidays, and 5 sick days. CABD has also intentionally made this role a remote position, with select in-person activities expected, to allow for greater flexibility.APPLICATION INSTRUCTIONSTo be considered, please submit your application electronically as one (1) PDF document tojobs@camilleabrown.orgwith “Executive Director” in the subject line. Applications are requested by or beforeMonday, April 15and will be reviewed in the order received.Applications should include: a resume, a cover letter highlighting your interest and qualifications, and at least three (3) professional references.All applications will be treated as confidential, and references will not be contacted without the candidate’s advance knowledge and agreement. Incomplete submissions will not be considered nor will submissions that are sent via postal mail, fax, or phone."
        }
    },
    {
        "url": "https://www.linkedin.com/jobs/view/medical-scribe-at-synergydirect-llc-3854122060?refId=RLyjqn9QpFhvKh4nOoJV3g%3D%3D&trackingId=4Qv5wb8GFTjFOLpeEy5zsw%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
        "dict": {
            "job_title": "Medical Scribe",
            "company_name": "SynergyDirect LLC",
            "location": "Torrance, CA",
            "seniority_level": "Entry level",
            "employment_type": "Full-time",
            "about": "Job DescriptionWe are seeking a Medical Scribe to join our team! You will transcribe medical reports by physicians and other healthcare practitioners.Responsibilities:Transcribe patient interactions room with doctor and patientTranslate abbreviations into proper formReview reports for completenessCorrect errors in transcription, grammar, punctuation and spellingQualifications:Previous experience in medical transcription or other related fieldsFamiliarity with transcription devicesFamiliarity with medical terminologyStrong attention to detail"
        }
    }
]